[
  {
    "Registro digital": "2029378",
    "Tesis": "P./J. 6/2024 (11a.)",
    "Rubro": "DOCUMENTOS DIGITALIZADOS PRESENTADOS ELECTRÓNICAMENTE PARA ACREDITAR EL INTERÉS JURÍDICO O LEGÍTIMO EN EL AMPARO. LA OMISIÓN DE MANIFESTAR BAJO PROTESTA DE DECIR VERDAD QUE SON COPIA ÍNTEGRA E INALTERADA DEL DOCUMENTO IMPRESO NO GENERA LA PREVENCIÓN O REPOSICIÓN DEL PROCEDIMIENTO, SINO QUE DEBAN VALORARSE COMO COPIA SIMPLE.",
    "Localización": "[J]; 11a. Época; Pleno; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029405",
    "Tesis": "P./J. 7/2024 (11a.)",
    "Rubro": "RECUSACIÓN EN EL AMPARO. LAS PARTES PUEDEN AMPLIAR LAS CAUSAS DE IMPEDIMENTO RESPECTO DE LAS ALEGADAS ORIGINALMENTE, POR LO QUE NO PROCEDE DESECHAR EL ESCRITO RELATIVO POR EL HECHO DE QUE EL EXPEDIENTE SE ENCUENTRE LISTO PARA SU RESOLUCIÓN, SIEMPRE QUE CUMPLAN LOS REQUISITOS QUE EXIGEN LA LEY DE AMPARO Y EL CÓDIGO FEDERAL DE PROCEDIMIENTOS CIVILES.",
    "Localización": "[J]; 11a. Época; Pleno; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029361",
    "Tesis": "1a./J. 147/2024 (11a.)",
    "Rubro": "ACCIÓN DE COMPENSACIÓN ECONÓMICA. LA EXIGENCIA DE QUE SE DETALLEN PORMENORIZADAMENTE LOS HECHOS QUE SUSTENTAN LA DEMANDA VULNERA EL DERECHO DE ACCESO A LA JUSTICIA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029363",
    "Tesis": "1a./J. 144/2024 (11a.)",
    "Rubro": "ACTOS DERIVADOS DE LAS REGLAS DE CONVIVENCIA DE UN CONDOMINIO. LA COMPETENCIA PARA RESOLVER LOS RECURSOS DERIVADOS DE UN JUICIO DE AMPARO SE SURTE A FAVOR DE LOS TRIBUNALES COLEGIADOS EN MATERIA CIVIL.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029364",
    "Tesis": "1a./J. 145/2024 (11a.)",
    "Rubro": "ADJUDICACIÓN DE BIEN INMUEBLE POR REMATE JUDICIAL. ES INCONSTITUCIONAL EXIGIR LA ESCRITURA PÚBLICA COMO REQUISITO PARA QUE SE ENTREGUE SU POSESIÓN POR VIOLAR EL DERECHO DE PROPIEDAD (LEGISLACIÓN CIVIL FEDERAL).",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029368",
    "Tesis": "1a./J. 148/2024 (11a.)",
    "Rubro": "COMPENSACIÓN ECONÓMICA POR DISOLUCIÓN DEL MATRIMONIO O DEL CONCUBINATO. TIENE DERECHO A RECLAMARLA QUIEN SE HAYA DEDICADO PREPONDERANTEMENTE A LAS LABORES DEL HOGAR Y AL CUIDADO FAMILIAR, CON INDEPENDENCIA DE SU GÉNERO.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029374",
    "Tesis": "1a./J. 136/2024 (11a.)",
    "Rubro": "CONTRADICCIÓN DE CRITERIOS ENTRE UN PLENO DE CIRCUITO Y UN TRIBUNAL COLEGIADO DE DIFERENTE CIRCUITO, PERO DE LA MISMA REGIÓN. LA SUPREMA CORTE DE JUSTICIA DE LA NACIÓN ES COMPETENTE PARA RESOLVERLA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029376",
    "Tesis": "1a./J. 137/2024 (11a.)",
    "Rubro": "COSA JUZGADA MATERIAL O REFLEJA. NO SE ACTUALIZA EN UN JUICIO DE PÉRDIDA DE PATRIA POTESTAD CUANDO PREVIAMENTE SE DICTÓ SENTENCIA ABSOLUTORIA EN UN PROCESO PENAL DERIVADO DE LOS MISMOS HECHOS.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029380",
    "Tesis": "1a./J. 138/2024 (11a.)",
    "Rubro": "DECLARACIONES O INFORMES DE TESTIGOS FALLECIDOS ANTES DE LA AUDIENCIA DE JUICIO ORAL. EL ARTÍCULO 386, FRACCIÓN I, DEL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES, AL PREVER SU INCORPORACIÓN MEDIANTE LECTURA, NO VULNERA LOS PRINCIPIOS DE CONTRADICCIÓN, INMEDIACIÓN E IGUALDAD PROCESAL.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029379",
    "Tesis": "1a./J. 139/2024 (11a.)",
    "Rubro": "DECLARACIONES O INFORMES DE TESTIGOS FALLECIDOS LEÍDOS EN LA AUDIENCIA DE JUICIO ORAL. SE INCORPORAN POR RAZONES DISTINTAS A LAS QUE DAN LUGAR A LA POSIBILIDAD DE DESAHOGAR MEDIOS DE PRUEBA DE FORMA ANTICIPADA (ARTÍCULOS 386, FRACCIÓN I, Y 304, FRACCIÓN II, DEL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES).",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029382",
    "Tesis": "1a./J. 140/2024 (11a.)",
    "Rubro": "DEMORA EN EL DICTADO DE LA SENTENCIA EN UN PROCEDIMIENTO PENAL ACUSATORIO. NO SE VULNERA EL PRINCIPIO DE INMEDIACIÓN CUANDO OCURRE CON MOTIVO DE LA INTERPOSICIÓN DE MEDIOS DE IMPUGNACIÓN, COMO PARTE DEL EJERCICIO DE LA DEFENSA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029393",
    "Tesis": "1a./J. 141/2024 (11a.)",
    "Rubro": "INFRACCIONES Y SANCIONES EN MATERIA MEDIOAMBIENTAL. LAS PREVISTAS EN LA LEY GENERAL DEL EQUILIBRIO ECOLÓGICO Y LA PROTECCIÓN AL AMBIENTE Y EN LA LEY GENERAL PARA LA PREVENCIÓN Y GESTIÓN INTEGRAL DE LOS RESIDUOS EN MATERIA AMBIENTAL, RESPETAN EL PRINCIPIO DE LEGALIDAD EN SU VERTIENTE DE TAXATIVIDAD.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029409",
    "Tesis": "1a./J. 142/2024 (11a.)",
    "Rubro": "RETENCIÓN DE BIENES EN MATERIA MERCANTIL. PARA OTORGARLA COMO MEDIDA CAUTELAR NO LE APLICAN LAS CONDICIONES DE LA \"APARIENCIA DEL BUEN DERECHO\" Y EL \"PELIGRO EN LA DEMORA\", LAS CUALES CORRESPONDEN A LA SUSPENSIÓN EN MATERIA DE AMPARO.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029412",
    "Tesis": "1a./J. 143/2024 (11a.)",
    "Rubro": "TOPES MÁXIMOS PARA LA CUANTIFICACIÓN DEL DAÑO MORAL. SON INCONSTITUCIONALES POR VULNERAR EL DERECHO DE LAS VÍCTIMAS A LA REPARACIÓN INTEGRAL.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029413",
    "Tesis": "1a./J. 146/2024 (11a.)",
    "Rubro": "USO ILEGAL DE UN BIEN PERTENECIENTE A LA NACIÓN. EL DELITO PREVISTO EN LA LEY GENERAL DE BIENES NACIONALES ES CONSTITUCIONAL.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029369",
    "Tesis": "1a./J. 121/2024 (11a.)",
    "Rubro": "COMPETENCIA PARA CONOCER DE JUICIOS DE AMPARO INDIRECTO RELACIONADOS CON LA MATERIA CONCURSAL PROMOVIDOS A PARTIR DEL SIETE DE MARZO DE DOS MIL VEINTIDÓS. CORRESPONDE A LOS JUZGADOS DE DISTRITO ESPECIALIZADOS EN MATERIA DE CONCURSOS MERCANTILES.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029383",
    "Tesis": "1a./J. 122/2024 (11a.)",
    "Rubro": "DENUNCIA DE CONTRADICCIÓN DE CRITERIOS REMITIDA POR RAZÓN COMPETENCIAL. LOS PLENOS REGIONALES PUEDEN DECLARARLA IMPROCEDENTE POR FALTA DE LEGITIMACIÓN SI EL DENUNCIANTE NO FUE PARTE EN ALGUNO DE LOS ASUNTOS RECIBIDOS.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029385",
    "Tesis": "1a. XVI/2024 (11a.)",
    "Rubro": "DERECHO A LA ASISTENCIA CONSULAR. REQUISITOS PARA QUE SU RENUNCIA SEA VÁLIDA.",
    "Localización": "[TA]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029366",
    "Tesis": "2a./J. 76/2024 (11a.)",
    "Rubro": "APERCIBIMIENTO DE DOBLE PAGO EN EL PROCEDIMIENTO DE EMBARGO. EL ARTÍCULO 958 DE LA LEY FEDERAL DEL TRABAJO, EN SU TEXTO ANTERIOR A LA REFORMA DE 1 DE MAYO DE 2019, NO PREVÉ UNA MULTA EXCESIVA NI TRANSGREDE LOS PRINCIPIOS PRO PERSONA Y DE PROGRESIVIDAD.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029365",
    "Tesis": "2a./J. 73/2024 (11a.)",
    "Rubro": "APORTACIONES COMPLEMENTARIAS. LAS RETENCIONES PREVISTAS EN EL \"CONVENIO QUE PARA DAR CUMPLIMIENTO A LA CLÁUSULA SEIS SEGUNDA DEL SIMILAR DE FECHA 14 DE OCTUBRE DE 2005\", CELEBRADO POR EL INSTITUTO MEXICANO DEL SEGURO SOCIAL Y EL SINDICATO CORRESPONDIENTE, NO VIOLAN LOS DERECHOS DE PROPIEDAD Y DE PROTECCIÓN AL SALARIO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029372",
    "Tesis": "2a./J. 77/2024 (11a.)",
    "Rubro": "CONCILIACIÓN COMO MECANISMO ALTERNO DE SOLUCIÓN DE CONFLICTOS. PROTEGE EL DERECHO DE ACCESO A LA TUTELA JUDICIAL EFECTIVA Y, POR TANTO, GUARDA ARMONÍA CON LOS MARCOS NORMATIVOS CONVENCIONAL Y CONSTITUCIONAL.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029375",
    "Tesis": "2a./J. 74/2024 (11a.)",
    "Rubro": "CONTRATO COLECTIVO DE TRABAJO. EL ESTUDIO DE SUS CLÁUSULAS DEBE REALIZARSE BAJO UNA INTERPRETACIÓN ESTRICTA Y LITERAL SIN SOSLAYAR EL PRINCIPIO DE BUENA FE CONTRACTUAL.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029384",
    "Tesis": "2a./J. 80/2024 (11a.)",
    "Rubro": "DERECHO AL MÍNIMO VITAL. SU CUMPLIMIENTO POR EL LEGISLADOR AL DISEÑAR UN ORDENAMIENTO TRIBUTARIO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029386",
    "Tesis": "2a./J. 75/2024 (11a.)",
    "Rubro": "DERECHOS POR LOS SERVICIOS RELACIONADOS CON EL OTORGAMIENTO DE PERMISOS PARA LA CONSTRUCCIÓN DE OBRAS DENTRO DEL DERECHO DE VÍA DE LOS CAMINOS Y PUENTES DE JURISDICCIÓN FEDERAL. EL ARTÍCULO 172, FRACCIONES I Y V, DE LA LEY FEDERAL DE DERECHOS VIGENTE EN 2022, QUE PREVÉN LAS CUOTAS PARA SU PAGO, NO VIOLA EL PRINCIPIO DE EQUIDAD TRIBUTARIA.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029391",
    "Tesis": "2a./J. 81/2024 (11a.)",
    "Rubro": "FRAUDE, ELUSIÓN, EVASIÓN O CONDUCTAS ILÍCITAS EN MATERIA FISCAL. SU PREVENCIÓN Y COMBATE SON UNA FINALIDAD CONSTITUCIONALMENTE VÁLIDA (ARTÍCULO 27, FRACCIÓN X, DE LA LEY DEL IMPUESTO SOBRE LA RENTA).",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029394",
    "Tesis": "2a./J. 49/2024 (11a.)",
    "Rubro": "INTERPRETACIÓN CONFORME. METODOLOGÍA PARA SU APLICACIÓN POR PARTE DE LOS ÓRGANOS JURISDICCIONALES.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029399",
    "Tesis": "2a./J. 47/2024 (11a.)",
    "Rubro": "LICENCIA POR CUIDADOS MÉDICOS. LIMITARLA A LOS CASOS DE MADRES O PADRES ASEGURADOS, CUYOS HIJOS HAYAN SIDO DIAGNOSTICADOS CON CÁNCER, TRANSGREDE LOS DERECHOS A LA IGUALDAD Y NO DISCRIMINACIÓN, ASÍ COMO A LA SEGURIDAD Y PREVISIÓN SOCIAL (ARTÍCULOS 140 BIS DE LA LEY DEL SEGURO SOCIAL Y 37 BIS DE LA LEY DEL INSTITUTO DE SEGURIDAD Y SERVICIOS SOCIALES DE LOS TRABAJADORES DEL ESTADO).",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029406",
    "Tesis": "2a./J. 72/2024 (11a.)",
    "Rubro": "REINTEGRO DE GASTOS MÉDICOS. EL ARTÍCULO 87 DEL REGLAMENTO DE PRESTACIONES MÉDICAS DEL INSTITUTO MEXICANO DEL SEGURO SOCIAL, QUE RELEVA DE RESPONSABILIDAD AL INSTITUTO CUANDO UN DERECHOHABIENTE DECIDE INTERNARSE EN UNA UNIDAD DISTINTA, NO VIOLA LOS PRINCIPIOS DE RESERVA DE LEY Y DE SUBORDINACIÓN JERÁRQUICA.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029407",
    "Tesis": "2a./J. 79/2024 (11a.)",
    "Rubro": "RENTA. EL ARTÍCULO 27, FRACCIÓN X, DE LA LEY DEL IMPUESTO RELATIVO, QUE ESTABLECE LOS REQUISITOS PARA QUE SEA PROCEDENTE LA DEDUCCIÓN POR ASISTENCIA TÉCNICA, TRANSFERENCIA DE TECNOLOGÍA O REGALÍAS, NO VIOLA EL DERECHO AL MÍNIMO VITAL.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029408",
    "Tesis": "2a./J. 78/2024 (11a.)",
    "Rubro": "RENTA. EL ARTÍCULO 27, FRACCIÓN X, DE LA LEY DEL IMPUESTO RELATIVO, QUE ESTABLECE LOS REQUISITOS PARA QUE SEA PROCEDENTE LA DEDUCCIÓN POR ASISTENCIA TÉCNICA, TRANSFERENCIA DE TECNOLOGÍA O REGALÍAS, NO VIOLA EL PRINCIPIO DE RAZONABILIDAD.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029389",
    "Tesis": "2a./J. 64/2024 (11a.)",
    "Rubro": "DIFERENCIAS SALARIALES Y/O PENSIONARIAS. PUEDE CONDENARSE A SU PAGO ACOTADO POR UN PERIODO QUE ABARQUE HASTA LA FECHA DE CUMPLIMIENTO DEL LAUDO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029392",
    "Tesis": "2a./J. 65/2024 (11a.)",
    "Rubro": "INCOMPETENCIA EN PROCEDIMIENTOS PARAPROCESALES REGULADOS POR LA LEY FEDERAL DEL TRABAJO. PREVIO A DECLARARLA, EL JUEZ LABORAL DEBE CITAR A LAS PARTES [APLICABILIDAD DE LA JURISPRUDENCIA 2a./J. 16/2023 (11a.)].",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029402",
    "Tesis": "2a./J. 71/2024 (11a.)",
    "Rubro": "PENSIÓN DE CESANTÍA EN EDAD AVANZADA. SU CUANTÍA DEBE ACTUALIZARSE ANUALMENTE CONFORME AL ÍNDICE NACIONAL DE PRECIOS AL CONSUMIDOR.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029403",
    "Tesis": "2a./J. 63/2024 (11a.)",
    "Rubro": "PRESCRIPCIÓN EN MATERIA LABORAL. FORMA DE COMPUTAR EL PLAZO DE 2 MESES PREVISTO EN EL ARTÍCULO 518 DE LA LEY FEDERAL DEL TRABAJO PARA EJERCER LAS ACCIONES DE LAS PERSONAS QUE SEAN SEPARADAS DEL EMPLEO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029398",
    "Tesis": "2a. I/2024 (11a.)",
    "Rubro": "LICENCIA POR CUIDADOS MÉDICOS. INTERPRETACIÓN CONFORME DE LOS ARTÍCULOS 140 BIS DE LA LEY DEL SEGURO SOCIAL Y 37 BIS DE LA LEY DEL INSTITUTO DE SEGURIDAD Y SERVICIOS SOCIALES DE LOS TRABAJADORES DEL ESTADO.",
    "Localización": "[TA]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029373",
    "Tesis": "(IV Región)1o. J/1 L (11a.)",
    "Rubro": "CONCILIACIÓN PREJUDICIAL. LOS CONFLICTOS INHERENTES A LA DESIGNACIÓN DE BENEFICIARIOS POR MUERTE DEL TRABAJADOR, ASÍ COMO AL PAGO DE PRESTACIONES LABORALES VINCULADAS INDISOLUBLEMENTE A ELLA ESTÁN EXENTOS DE AGOTARLA, EN TÉRMINOS DE LA FRACCIÓN II DEL ARTÍCULO 685 TER DE LA LEY FEDERAL DEL TRABAJO.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029400",
    "Tesis": "I.20o.A. J/7 K (11a.)",
    "Rubro": "MEDIDA CAUTELAR CON EFECTOS RESTITUTORIOS ANTICIPADOS EN EL PROCESO DE AMPARO. DEBE CONCEDERSE CUANDO SE ACREDITE UN RIESGO OBJETIVO DE AFECTACIÓN A LOS DERECHOS HUMANOS ANTE LA INCERTIDUMBRE DE UNA EVENTUAL NEGATIVA DEL AMPARO.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029362",
    "Tesis": "XXX.3o.9 C (11a.)",
    "Rubro": "ACCIÓN DE CONTRADICCIÓN DE PATERNIDAD. EL CÓMPUTO DEL PLAZO PARA EJERCERLA CUANDO SE ADUCE CONOCER EL VERDADERO VÍNCULO BIOLÓGICO UNA VEZ CUMPLIDA LA MAYORÍA DE EDAD, DEBE COMPUTARSE A PARTIR DE QUE LA PERSONA PROMOVENTE TUVO NOTICIA DE DICHO ORIGEN (LEGISLACIÓN DEL ESTADO DE AGUASCALIENTES).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029387",
    "Tesis": "VI.1o.A.18 A (11a.)",
    "Rubro": "DESAPARICIÓN FORZADA DE PERSONAS. LA AFECTACIÓN DEL DERECHO A LA BÚSQUEDA, DERIVADA DE LAS DECLARACIONES ESTIGMATIZANTES Y CRIMINALIZANTES DE UN ALTO FUNCIONARIO PÚBLICO RESPECTO DE LAS VÍCTIMAS DIRECTAS E INDIRECTAS, PUEDE REPARARSE COMO EFECTO DE LA EVENTUAL CONCESIÓN DEL AMPARO, A PESAR DEL FALLECIMIENTO DE AQUÉL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029388",
    "Tesis": "VI.1o.A.19 A (11a.)",
    "Rubro": "DESAPARICIÓN FORZADA DE PERSONAS. LAS DECLARACIONES EMITIDAS POR UN ALTO FUNCIONARIO PÚBLICO RESPECTO DE LAS VÍCTIMAS DIRECTAS E INDIRECTAS, VIOLAN EL DERECHO A LA BÚSQUEDA SI SE EMITEN EN UN TONO QUE LAS ESTIGMATIZA Y CRIMINALIZA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029390",
    "Tesis": "VII.1o.C.16 C (11a.)",
    "Rubro": "EMBARGO DE DINERO CONTENIDO EN CUENTAS BANCARIAS DECRETADO POR LA CANTIDAD LÍQUIDA IMPUESTA COMO CONDENA EN EL JUICIO ORAL MERCANTIL. PROCEDE EL AMPARO INDIRECTO SÓLO CONTRA LA RESOLUCIÓN EN LA QUE SE REQUIERE A LAS INSTITUCIONES DE CRÉDITO LA ENTREGA AL ÓRGANO JURISDICCIONAL DE LA CANTIDAD ASEGURADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029396",
    "Tesis": "XXI.2o.C.T.31 C (11a.)",
    "Rubro": "LAUDO ARBITRAL. LA COPIA CERTIFICADA EXPEDIDA POR ÁRBITRO PRIVADO NO ES OPONIBLE AL DERECHO DE PROPIEDAD DEL ADJUDICATARIO EN REMATE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029397",
    "Tesis": "XXI.2o.C.T.30 C 11a.)",
    "Rubro": "LEGITIMACIÓN EN LA ACCIÓN DE INTERDICTO DE RECOBRAR LA POSESIÓN. REQUISITOS PARA ACREDITARLA TRATÁNDOSE DE UN INMUEBLE DE ORIGEN EJIDAL, REGULARIZADO POR LA COMISIÓN PARA LA REGULARIZACIÓN DE LA TENENCIA DE LA TIERRA (CORETT) (LEGISLACIÓN DEL ESTADO DE GUERRERO).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029401",
    "Tesis": "XXI.2o.C.T.41 C (11a.)",
    "Rubro": "PÓLIZA DE SEGURO. EL RECLAMO DE SU CUMPLIMIENTO PUEDE HACERSE TANTO EN EL DOMICILIO QUE APARECE EN LA CARÁTULA DE LA PÓLIZA, COMO EN ALGUNA DE LAS SUCURSALES DE LA ASEGURADORA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029410",
    "Tesis": "XXI.2o.C.T.34 C (11a.)",
    "Rubro": "SOCIEDAD CONYUGAL. LOS EFECTOS QUE EL ARTÍCULO 444 DEL CÓDIGO CIVIL DEL ESTADO LIBRE Y SOBERANO DE GUERRERO NÚMERO 358 ESTABLECE SOBRE LOS BIENES QUE LA INTEGRAN, DEBEN DURAR HASTA QUE SE ACREDITE QUE UNO DE LOS CÓNYUGES SOSTIENE UNA RELACIÓN DE CONCUBINATO CON OTRA PERSONA POR MÁS DE DOS AÑOS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029371",
    "Tesis": "PR.P.T.CS. J/6 K (11a.)",
    "Rubro": "COMPETENCIA POR TERRITORIO PARA CONOCER DEL RECURSO DE REVISIÓN EN AMPARO INDIRECTO CONTRA LA SENTENCIA DICTADA POR UN TRIBUNAL COLEGIADO DE APELACIÓN EN AUXILIO A SU HOMÓLOGO DEL CIRCUITO MÁS CERCANO. CORRESPONDE AL TRIBUNAL COLEGIADO DE CIRCUITO CON JURISDICCIÓN SOBRE EL ÓRGANO AUXILIADO.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029367",
    "Tesis": "PR.P.T.CS. J/15 L (11a.)",
    "Rubro": "AUTORIDAD RESPONSABLE PARA LOS EFECTOS DEL AMPARO. TIENE ESE CARÁCTER LA COMISIÓN DE TRABAJO, PREVISIÓN Y SEGURIDAD SOCIAL DEL CONGRESO DEL ESTADO DE MORELOS, CUANDO NIEGA EL OTORGAMIENTO DE UNA PENSIÓN POR JUBILACIÓN.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029377",
    "Tesis": "PR.P.T.CS. J/12 L (11a.)",
    "Rubro": "CENTROS DE CONCILIACIÓN LABORAL (LOCALES Y FEDERAL). LAS FUNCIONES QUE REALIZAN EN LA ETAPA PREJUDICIAL DEL PROCEDIMIENTO LABORAL SON MATERIALMENTE JURISDICCIONALES.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029381",
    "Tesis": "PR.P.T.CS. J/5 K (11a.)",
    "Rubro": "DEMANDA DE AMPARO DIRECTO. LA CONSTANCIA DE NOTIFICACIÓN GENERADA AUTOMÁTICAMENTE POR EL SISTEMA ELECTRÓNICO DEL PORTAL DE SERVICIOS EN LÍNEA DEL PODER JUDICIAL DE LA FEDERACIÓN, EN TÉRMINOS DEL ARTÍCULO 30, FRACCIÓN II, SEGUNDO PÁRRAFO, DE LA LEY DE AMPARO, ES APTA PARA COMPUTAR EL PLAZO PARA PRESENTARLA.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029395",
    "Tesis": "PR.P.T.CS. J/14 L (11a.)",
    "Rubro": "JUBILACIÓN POR AJUSTES DE PERSONAL DE TRABAJADORES DE CONFIANZA DE PETRÓLEOS MEXICANOS Y ORGANISMOS SUBSIDIARIOS. CUANDO SE AUTORIZA CON DISPENSA DE EDAD SE CONFIGURA UNA JUBILACIÓN EXCEPCIONAL Y SU CÁLCULO DEBE SER PROPORCIONAL A LA EDAD Y AÑOS DE SERVICIO PRESTADOS [ARTÍCULO 85, INCISO B), RELACIONADO CON EL 82, REGLA II, DEL REGLAMENTO DE TRABAJO RELATIVO VIGENTE EN 2019].",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029404",
    "Tesis": "PR.P.T.CS. J/13 L (11a.)",
    "Rubro": "RECURSO DE REVISIÓN EN AMPARO INDIRECTO. LOS CENTROS DE CONCILIACIÓN LABORAL (LOCALES Y FEDERAL) CARECEN DE LEGITIMACIÓN PARA INTERPONERLO CUANDO LOS ACTOS RECLAMADOS DERIVEN DE SUS FUNCIONES DE CONCILIACIÓN.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029411",
    "Tesis": "PR.P.T.CS. J/10 L (11a.)",
    "Rubro": "SALARIOS CAÍDOS. SU PAGO DEBE ESTABLECERSE CON FUNDAMENTO EN LA LEGISLACIÓN BUROCRÁTICA ESTATAL VIGENTE EN LA FECHA EN LA QUE SE PRESENTÓ LA DEMANDA LABORAL.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029370",
    "Tesis": "PR.P.T.CS. 3 L (11a.)",
    "Rubro": "COMPETENCIA POR MATERIA PARA CONOCER DEL AMPARO DIRECTO CONTRA EL LAUDO DEL TRIBUNAL DE ARBITRAJE Y ESCALAFÓN QUE RESUELVE SOBRE LA LIQUIDACIÓN O PAGO TOTAL DEL ADEUDO PENDIENTE DEL CRÉDITO HIPOTECARIO CONTRATADO CON EL INSTITUTO DE PENSIONES DEL ESTADO DE JALISCO, MEDIANTE LA UTILIZACIÓN DEL FONDO DE GARANTÍA. CORRESPONDE AL TRIBUNAL COLEGIADO DE CIRCUITO EN MATERIA DE TRABAJO.",
    "Localización": "[TA]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029352",
    "Tesis": "2a./J. 69/2024 (11a.)",
    "Rubro": "ACCESIBILIDAD DE PERSONAS CON DISCAPACIDAD VISUAL. EL ARTÍCULO 8 DE LA LEY FEDERAL DE CINEMATOGRAFÍA ES INCONSTITUCIONAL PORQUE OMITE QUE LAS PELÍCULAS EXHIBIDAS EN LAS SALAS DE CINE DEBAN SER DOBLADAS AL ESPAÑOL Y CON AUDIO DESCRIPCIÓN.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029357",
    "Tesis": "2a./J. 68/2024 (11a.)",
    "Rubro": "RECURSO DE REVOCACIÓN PREVISTO EN EL ARTÍCULO 175, PÁRRAFO SEGUNDO, DEL CÓDIGO FISCAL DE LA FEDERACIÓN. AL PREVER QUE EN EL MISMO ESCRITO EN QUE SE HAGA VALER SE DESIGNE AL PERITO RESPECTIVO, NO TRANSGREDE EL DERECHO DE AUDIENCIA.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029351",
    "Tesis": "2a. II/2024 (11a.)",
    "Rubro": "ACCESIBILIDAD DE PERSONAS CON DISCAPACIDAD VISUAL. EFECTOS DEL AMPARO OTORGADO CONTRA EL ARTÍCULO 8 DE LA LEY FEDERAL DE CINEMATOGRAFÍA QUE OMITE ESTABLECER QUE LAS PELÍCULAS EXHIBIDAS EN LAS SALAS DE CINE DEBAN SER DOBLADAS AL ESPAÑOL Y CON AUDIO DESCRIPCIÓN.",
    "Localización": "[TA]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029354",
    "Tesis": "II.3o.A.34 A (11a.)",
    "Rubro": "CADUCIDAD EN EL JUICIO AGRARIO. EL PLAZO DE CUATRO MESES PARA QUE OPERE, PREVISTO EN EL ARTÍCULO 190 DE LA LEY RELATIVA, DEBE SUSPENDERSE SI ESTÁ PENDIENTE DE RESOLUCIÓN UN JUICIO DE AMPARO INDIRECTO EN EL QUE SE IMPUGNAN CUESTIONES QUE DEJAN SUBJÚDICE SU RESOLUCIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029355",
    "Tesis": "II.3o.A.37 A (11a.)",
    "Rubro": "LEGITIMACIÓN EN EL JUICIO DE AMPARO INDIRECTO. CARECE DE ÉSTA LA PERSONA MORAL OFICIAL DEL ESTADO DE MÉXICO QUE FUE AUTORIDAD DEMANDADA EN EL JUICIO CONTENCIOSO ADMINISTRATIVO LOCAL DEL QUE DERIVÓ EL INCIDENTE DE LIQUIDACIÓN RECLAMADO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029358",
    "Tesis": "II.3o.A.36 A (11a.)",
    "Rubro": "SECTOR HIDROCARBUROS. AL SER DE JURISDICCIÓN FEDERAL, SÓLO EL GOBIERNO FEDERAL PUEDE DICTAR LAS DISPOSICIONES TÉCNICAS, REGLAMENTARIAS Y DE REGULACIÓN EN ESA MATERIA, INCLUYENDO LAS RELACIONADAS CON EL DESARROLLO SUSTENTABLE, EL EQUILIBRIO ECOLÓGICO Y LA PROTECCIÓN AL MEDIO AMBIENTE EN EL DESARROLLO DE ESA INDUSTRIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029359",
    "Tesis": "II.3o.A.35 A (11a.)",
    "Rubro": "TRIBUNAL DE JUSTICIA ADMINISTRATIVA DEL ESTADO DE MÉXICO. ES COMPETENTE PARA CONOCER DE LAS CONTROVERSIAS SUSCITADAS POR ACTOS RELACIONADOS CON LA OPERACIÓN DE ESTABLECIMIENTOS DE EXPENDIO DE GAS NATURAL (HIDROCARBUROS), ÚNICAMENTE RESPECTO A LA MATERIA DE PROTECCIÓN CIVIL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029353",
    "Tesis": "PR.P.T.CS. J/11 L (11a.)",
    "Rubro": "AMPARO INDIRECTO. PROCEDE CONTRA LA MULTA IMPUESTA AL AYUNTAMIENTO CONDENADO EN EL JUICIO LABORAL BUROCRÁTICO, EN LA ETAPA DE EJECUCIÓN DEL LAUDO (LEGISLACIÓN DEL ESTADO DE JALISCO).",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029356",
    "Tesis": "PR.A.C.CS. J/6 A (11a.)",
    "Rubro": "RECONSIDERACIÓN ADMINISTRATIVA. PROCEDE CONTRA LAS RESOLUCIONES ADMINISTRATIVAS DEFINITIVAS DE CARÁCTER INDIVIDUAL DESFAVORABLES AL PARTICULAR, CON INDEPENDENCIA DE QUE CONTENGAN UN CRÉDITO FISCAL (ARTÍCULO 36 DEL CÓDIGO FISCAL DE LA FEDERACIÓN).",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029304",
    "Tesis": "1a./J. 127/2024 (11a.)",
    "Rubro": "CONTRADICCIÓN DE CRITERIOS. ES IMPROCEDENTE CUANDO UNO DE LOS TRIBUNALES COLEGIADOS CONTENDIENTES SUSTENTA SU RESOLUCIÓN EN UN PRECEDENTE OBLIGATORIO EMITIDO POR LA SUPREMA CORTE DE JUSTICIA DE LA NACIÓN.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029310",
    "Tesis": "1a./J. 128/2024 (11a.)",
    "Rubro": "CONTRATOS DE PRESTACIÓN DE SERVICIOS CELEBRADOS CON CENTROS DE READAPTACIÓN SOCIAL. SU NATURALEZA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029315",
    "Tesis": "1a./J. 129/2024 (11a.)",
    "Rubro": "DESINDEXACIÓN DEL SALARIO MÍNIMO. LA REFORMA CONSTITUCIONAL EN LA MATERIA NO ESTABLECE UNA REGLA ABSOLUTA DE SUSTITUCIÓN DEL SALARIO MÍNIMO POR LA UNIDAD DE MEDIDA Y ACTUALIZACIÓN (UMA), SINO UNA REGLA DE JUICIO APLICABLE CASO POR CASO.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029316",
    "Tesis": "1a./J. 131/2024 (11a.)",
    "Rubro": "DESISTIMIENTO DEL JUICIO DE AMPARO CUANDO SE INVOLUCREN DERECHOS DE NIÑAS, NIÑOS Y ADOLESCENTES. PARA AUTORIZARLO DEBE VERIFICARSE QUE LA RENUNCIA A LA ACCIÓN JUDICIAL NO VULNERA EL INTERÉS SUPERIOR DE LA INFANCIA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029319",
    "Tesis": "1a./J. 132/2024 (11a.)",
    "Rubro": "FONDO DE AYUDA, ASISTENCIA Y REPARACIÓN INTEGRAL. EL ARTÍCULO 132, FRACCIÓN I, DE LA LEY GENERAL DE VÍCTIMAS QUE SUPRIME LA GARANTÍA PRESUPUESTARIA DEL 0.014 % VIOLA EL PRINCIPIO DE PROGRESIVIDAD EN RELACIÓN CON EL DERECHO HUMANO A UNA REPARACIÓN INTEGRAL DEL DAÑO.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029321",
    "Tesis": "1a./J. 130/2024 (11a.)",
    "Rubro": "INDEMNIZACIÓN POR DAÑOS PATRIMONIALES DERIVADOS DE LA MUERTE O INCAPACIDAD DE LAS PERSONAS. DEBE RECURRIRSE AL SALARIO MÍNIMO Y NO A LA UNIDAD DE MEDIDA Y ACTUALIZACIÓN (UMA) COMO BASE DE CUANTIFICACIÓN DEL LUCRO CESANTE (LEGISLACIÓN PARA LA CIUDAD DE MÉXICO).",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029337",
    "Tesis": "1a./J. 133/2024 (11a.)",
    "Rubro": "PRINCIPIO DE PROGRESIVIDAD DE LOS DERECHOS HUMANOS. LAS AUTORIDADES DEL ESTADO TIENEN LA OBLIGACIÓN DE JUSTIFICAR LA IMPLEMENTACIÓN DE UNA MEDIDA REGRESIVA SOBRE ALGUNA DE LAS GARANTÍAS PRESUPUESTARIAS QUE HAGAN EFECTIVO UN DERECHO HUMANO.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029344",
    "Tesis": "1a./J. 134/2024 (11a.)",
    "Rubro": "SERVICIOS DE SALUD EN CENTROS PENITENCIARIOS. EL QUE NO SEAN EXIGIBLES MEDIANTE UNA ACCIÓN COLECTIVA CIVIL NO VIOLA EL DERECHO DE ACCESO A LA JUSTICIA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029343",
    "Tesis": "1a./J. 135/2024 (11a.)",
    "Rubro": "SOLICITUD DE AMNISTÍA EN EL ÁMBITO FEDERAL. VÍAS PARA IMPUGNAR LA NEGATIVA POR PARTE DE LA COMISIÓN DE AMNISTÍA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029302",
    "Tesis": "2a./J. 67/2024 (11a.)",
    "Rubro": "CONDONACIÓN DE CRÉDITOS FISCALES. EL ARTÍCULO TERCERO TRANSITORIO, FRACCIÓN VII, DE LA LEY DE INGRESOS DE LA FEDERACIÓN PARA EL EJERCICIO FISCAL DE 2013, ESTABLECE UNA CLÁUSULA DE INIMPUGNABILIDAD DE LAS RESOLUCIONES DICTADAS CON MOTIVO DE LA SOLICITUD RELATIVA, SÓLO APLICABLE A LOS CONTRIBUYENTES RESPECTO DE LOS MEDIOS DE DEFENSA ORDINARIOS.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029329",
    "Tesis": "2a./J. 66/2024 (11a.)",
    "Rubro": "PARTICIPACIÓN DE LOS TRABAJADORES EN LAS UTILIDADES. EL ARTÍCULO 127, FRACCIÓN VIII, DE LA LEY FEDERAL DEL TRABAJO NO VIOLA EL PRINCIPIO DE IRRETROACTIVIDAD DE LA LEY NI EL DERECHO DE PARTICIPACIÓN EN LAS UTILIDADES DE LA FUENTE DE TRABAJO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029307",
    "Tesis": "2a. V/2024 (11a.)",
    "Rubro": "CONTROL DEL TABACO. EL ARTÍCULO 60, PÁRRAFO PRIMERO, FRACCIONES I, II Y III, DEL REGLAMENTO DE LA LEY GENERAL RELATIVA, AL PREVER LA PROHIBICIÓN DE BRINDAR LA PRESTACIÓN DE CUALQUIER SERVICIO O CONSUMO DE ALIMENTOS, BEBIDAS O ENTRETENIMIENTO EN LAS ZONAS EXCLUSIVAMENTE PARA FUMAR, TRANSGREDE EL PRINCIPIO DE SUBORDINACIÓN JERÁRQUICA (DECRETO PUBLICADO EN EL DIARIO OFICIAL DE LA FEDERACIÓN EL 16 DE DICIEMBRE DE 2022).",
    "Localización": "[TA]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029308",
    "Tesis": "2a. IV/2024 (11a.)",
    "Rubro": "CONTROL DEL TABACO. EL ARTÍCULO 65 DEL REGLAMENTO DE LA LEY GENERAL RELATIVA, AL PREVER QUE EN LOS LUGARES DESTINADOS AL HOSPEDAJE DE PERSONAS PUEDAN EXISTIR ZONAS EXCLUSIVAMENTE PARA FUMAR EN ESPACIOS AL AIRE LIBRE, PERO CONDICIONADAS AL CUMPLIMIENTO DE LAS REGLAS DEL DIVERSO 60 DEL MISMO ORDENAMIENTO, TRANSGREDE EL PRINCIPIO DE SUBORDINACIÓN JERÁRQUICA (DECRETO PUBLICADO EN EL DIARIO OFICIAL DE LA FEDERACIÓN EL 16 DE DICIEMBRE DE 2022).",
    "Localización": "[TA]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029309",
    "Tesis": "2a. III/2024 (11a.)",
    "Rubro": "CONTROL DEL TABACO. EL ARTÍCULO 79, FRACCIÓN I, DEL REGLAMENTO DE LA LEY GENERAL RELATIVA, QUE ESTABLECE COMO MEDIDA DE SEGURIDAD LA SUSPENSIÓN DE LA PUBLICIDAD, PROMOCIÓN Y PATROCINIO, ASÍ COMO DE LOS TRABAJOS O SERVICIOS, DE MANERA TOTAL Y PERMANENTE, TRANSGREDE EL PRINCIPIO DE SUBORDINACIÓN JERÁRQUICA (DECRETO PUBLICADO EN EL DIARIO OFICIAL DE LA FEDERACIÓN EL 16 DE DICIEMBRE DE 2022).",
    "Localización": "[TA]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029293",
    "Tesis": "I.16o.T. J/2 L (11a.)",
    "Rubro": "AGUINALDO DE LAS PERSONAS TRABAJADORAS DE LABORATORIOS DE BIOLÓGICOS Y REACTIVOS DE MÉXICO, S.A. DE C.V. (BIRMEX). DEBE PAGARSE CON EL SUELDO TABULAR, MÁS LOS CONCEPTOS DE AYUDA PARA GASTOS DE ACTUALIZACIÓN Y ASIGNACIÓN BRUTA MENSUAL.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029294",
    "Tesis": "III.2o.A.9 A (11a.)",
    "Rubro": "AMPARO INDIRECTO. PROCEDE CONTRA LA BOLETA DE SEPARACIÓN TEMPORAL DEL SERVICIO DE LOS INTEGRANTES DE LA POLICÍA PREVENTIVA MUNICIPAL DE SAN PEDRO TLAQUEPAQUE, JALISCO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029295",
    "Tesis": "XXVII.1o.5 A (11a.)",
    "Rubro": "AMPLIACIÓN DE LA DEMANDA DE AMPARO INDIRECTO. CUANDO SE RECLAMEN ACTOS QUE PUEDAN TENER POR EFECTO PRIVAR TOTAL O PARCIALMENTE, EN FORMA TEMPORAL O DEFINITIVA DE LA PROPIEDAD, POSESIÓN O DISFRUTE DE DERECHOS EJIDALES, EL PLAZO PARA SU PRESENTACIÓN ES EL PREVISTO EN LA FRACCIÓN III DEL ARTÍCULO 17 DE LA LEY DE AMPARO, SIEMPRE QUE NO SE HAYA CELEBRADO LA AUDIENCIA CONSTITUCIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029297",
    "Tesis": "III.2o.A.2 A (11a.)",
    "Rubro": "ASAMBLEA GENERAL DE EJIDATARIOS O COMUNEROS. SI SE CELEBRÓ DURANTE LA VIGENCIA DE LA DEROGADA LEY FEDERAL DE REFORMA AGRARIA Y EL ACTOR TUVO CONOCIMIENTO DE SU EXISTENCIA DESPUÉS DE QUE ENTRÓ EN VIGOR LA LEY AGRARIA, ES APLICABLE EL PLAZO DE PRESCRIPCIÓN PREVISTO POR EL ARTÍCULO 61 DE ESTA ÚLTIMA PARA DEMANDAR SU NULIDAD, SIN QUE ELLO IMPLIQUE VIOLACIÓN A LA GARANTÍA DE IRRETROACTIVIDAD DE LA LEY.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029301",
    "Tesis": "VII.1o.P.3 K (11a.)",
    "Rubro": "COMPETENCIA POR TERRITORIO PARA CONOCER DEL AMPARO INDIRECTO CONTRA LA RESOLUCIÓN QUE CONFIRMA EL AUTO DE NO VINCULACIÓN A PROCESO. SE SURTE EN FAVOR DEL ÓRGANO CON JURISDICCIÓN EN EL LUGAR EN QUE RESIDE LA AUTORIDAD ANTE QUIEN SE ENCUENTRA RADICADO EL PROCESO PENAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029311",
    "Tesis": "VII.2o.P.5 P (11a.)",
    "Rubro": "DATOS DE PRUEBA PRESENTADOS POR LA PERSONA IMPUTADA O SU DEFENSOR EN EL PLAZO CONSTITUCIONAL O SU AMPLIACIÓN. NO LES ES APLICABLE LA CARGA DE JUSTIFICAR SU PERTINENCIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029313",
    "Tesis": "I.2o.T.23 L (11a.)",
    "Rubro": "DESIGNACIÓN DE BENEFICIARIOS DE LA PERSONA TRABAJADORA FALLECIDA. EL CRITERIO RELEVANTE PARA RECONOCER ESE CARÁCTER ES LA DEPENDENCIA ECONÓMICA Y NO EL PARENTESCO POR CONSANGUINIDAD.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029314",
    "Tesis": "I.2o.T.22 L (11a.)",
    "Rubro": "DESIGNACIÓN DE BENEFICIARIOS DE LA PERSONA TRABAJADORA FALLECIDA. LA OMISIÓN DE LLAMAR AL PROCEDIMIENTO RELATIVO A QUIENES CONSIDERAN TENER DERECHO DEBE RECLAMARSE EN AMPARO DIRECTO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029317",
    "Tesis": "III.2o.T.70 L (11a.)",
    "Rubro": "DESPIDO DE PERSONAS TRABAJADORAS CON MÁS DE 20 AÑOS DE SERVICIOS, SIN RESPONSABILIDAD PARA EL PATRÓN. CONFORME AL PRINCIPIO DE REALIDAD, LAS PERSONAS JUZGADORAS ESTÁN FACULTADAS PARA DETERMINAR SI LA GRAVEDAD DE LA FALTA HACE IMPOSIBLE LA CONTINUACIÓN DE LA RELACIÓN, CON INDEPENDENCIA DE LAS PROBABLES CONTRADICCIONES EN LA DEFENSA DE LA DEMANDADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029318",
    "Tesis": "I.7o.C.22 C (11a.)",
    "Rubro": "EXCEPCIÓN DE PAGO EN EL JUICIO EJECUTIVO MERCANTIL. CONDICIONES PARA QUE UNA SENTENCIA DICTADA EN UN DIVERSO JUICIO PUEDA ACREDITARLA, CUANDO NO HA CIRCULADO EL TÍTULO DE CRÉDITO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029320",
    "Tesis": "VII.2o.C.68 K (11a.)",
    "Rubro": "IMPROCEDENCIA DEL AMPARO DIRECTO EN EL RECURSO DE RECLAMACIÓN. EL PLENO DEL TRIBUNAL COLEGIADO DE CIRCUITO PUEDE ANALIZAR SI SE ACTUALIZA, CUANDO SE RECLAME UNA SENTENCIA DICTADA EN CUMPLIMIENTO A LOS LINEAMIENTOS DE UNA EJECUTORIA DE AMPARO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029322",
    "Tesis": "V.4o.P.A.1 K (11a.)",
    "Rubro": "INFORME JUSTIFICADO. OPERA LA DERROTABILIDAD DE LA PRESUNCIÓN DE SER CIERTA LA OMISIÓN RECLAMADA EN AMPARO ANTE LA FALTA DE RENDIRLO O DE MANIFESTACIÓN DE LAS AUTORIDADES RESPONSABLES EN TORNO A SU EXISTENCIA, CUANDO OBREN ELEMENTOS QUE ACREDITEN LO CONTRARIO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029323",
    "Tesis": "II.4o.P.1 CS (11a.)",
    "Rubro": "JUZGAR CON PERSPECTIVA DE DISCAPACIDAD. IMPLICA ORDENAR LOS AJUSTES NECESARIOS AL PROCEDIMIENTO Y PRONUNCIARSE SOBRE OTRO TIPO DE APOYOS FUERA DE ÉSTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029324",
    "Tesis": "III.2o.A.10 A (11a.)",
    "Rubro": "LEGITIMACIÓN EN EL RECURSO DE QUEJA EN AMPARO INDIRECTO. CARECE DE ÉSTA EL TRIBUNAL ELECTORAL DEL ESTADO DE JALISCO CONTRA EL AUTO QUE ADMITE LA DEMANDA DE AMPARO INDIRECTO EN QUE SE RECLAMA UNO DIVERSO EMITIDO EN SU FUNCIÓN JURISDICCIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029325",
    "Tesis": "I.6o.P.6 P (11a.)",
    "Rubro": "LIBERTAD ANTICIPADA. LA RESTRICCIÓN PARA SU CONCESIÓN, PREVISTA EN EL ÚLTIMO PÁRRAFO DEL ARTÍCULO 141 DE LA LEY NACIONAL DE EJECUCIÓN PENAL, SE ACTUALIZA CUANDO LA PERSONA PRIVADA DE LA LIBERTAD ES SENTENCIADA POR CUALQUIERA DE LOS TRES DELITOS AHÍ MENCIONADOS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029326",
    "Tesis": "I.20o.A.3 K (11a.)",
    "Rubro": "MEDIDA CAUTELAR CON EFECTOS RESTITUTORIOS ANTICIPADOS EN EL PROCESO DE AMPARO. DEBE CONCEDERSE CUANDO SE ACREDITE UN RIESGO OBJETIVO DE AFECTACIÓN A LOS DERECHOS HUMANOS ANTE LA INCERTIDUMBRE DE UNA EVENTUAL NEGATIVA DEL AMPARO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029292",
    "Tesis": "III.2o.T.69 L (11a.)",
    "Rubro": "OFRECIMIENTO DE TRABAJO. NO ES DE MALA FE CUANDO POR LAS PARTICULARIDADES DEL CASO, LA REINSTALACIÓN SE LLEVA A CABO EN EL DOMICILIO DE LA AUTORIDAD LABORAL, SI NO EXISTE UNO DEL PATRÓN NI ALGUNO CIERTO Y DETERMINADO PARA EL DESARROLLO DE LAS LABORES.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029296",
    "Tesis": "XI.P.10 P (11a.)",
    "Rubro": "ORDEN DE APREHENSIÓN EN EL SISTEMA PENAL ACUSATORIO. EL CÓMPUTO DEL PLAZO DE QUINCE DÍAS PARA PROMOVER AMPARO INDIRECTO EN SU CONTRA, INICIA A PARTIR DEL DÍA SIGUIENTE AL EN QUE LA PERSONA QUEJOSA HAYA TENIDO CONOCIMIENTO DE AQUÉLLA O DE SU EJECUCIÓN, O AL EN QUE SE HAYA OSTENTADO SABEDORA DE SU EXISTENCIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029328",
    "Tesis": "I.2o.T.30 L (11a.)",
    "Rubro": "PAGO DE LABORES PELIGROSAS E INSALUBRES DE LAS PERSONAS TRABAJADORAS DE PETRÓLEOS MEXICANOS (PEMEX). AL PROCEDER HASTA LA FECHA DEL LAUDO Y MIENTRAS SE EJECUTE EL TRABAJO, ES VÁLIDA LA APERTURA DEL INCIDENTE DE LIQUIDACIÓN PARA CUANTIFICARLO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029327",
    "Tesis": "I.2o.T.29 L (11a.)",
    "Rubro": "PAGO DE LABORES PELIGROSAS E INSALUBRES DE LAS PERSONAS TRABAJADORAS DE PETRÓLEOS MEXICANOS (PEMEX). DEBE CUANTIFICARSE POR TODA LA JORNADA LABORAL Y NO POR HORA O FRACCIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029330",
    "Tesis": "VII.2o.C.63 C (11a.)",
    "Rubro": "PENSIÓN COMPENSATORIA RESARCITORIA. ES FACTIBLE CONSIDERAR COMO PARTE DE ÉSTA EL SERVICIO MÉDICO AL QUE TIENE DERECHO EL EXCÓNYUGE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029331",
    "Tesis": "V.4o.P.A.10 A (11a.)",
    "Rubro": "PENSIÓN POR JUBILACIÓN OTORGADA POR EL INSTITUTO DE SEGURIDAD Y SERVICIOS SOCIALES DE LOS TRABAJADORES DEL ESTADO DE SONORA (ISSSTESON). LA OBLIGACIÓN DE AUMENTAR SU MONTO COMIENZA A PARTIR DEL 1 DE ENERO DEL AÑO SIGUIENTE A QUE LA PERSONA FUE DADA DE ALTA EN LA NÓMINA DE PENSIONADOS Y JUBILADOS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029332",
    "Tesis": "V.4o.P.A.12 A (11a.)",
    "Rubro": "PENSIÓN POR MUERTE A CONSECUENCIA DE UN RIESGO PROFESIONAL. SU MONTO DEBE CALCULARSE CON EL SUELDO PERCIBIDO POR LA PERSONA SERVIDORA PÚBLICA AL MOMENTO DE SU FALLECIMIENTO (LEGISLACIÓN DEL ESTADO DE SONORA).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029333",
    "Tesis": "III.2o.T.68 L (11a.)",
    "Rubro": "PERSONAL OPERATIVO DE LA UNIVERSIDAD DE GUADALAJARA. LA PRESENTACIÓN DE UN CERTIFICADO DE SECUNDARIA FALSO PARA SU CONTRATACIÓN, CONSTITUYE UNA FALTA GRAVE DE PROBIDAD U HONRADEZ.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029334",
    "Tesis": "III.2o.A.6 A (11a.)",
    "Rubro": "PERSONALIDAD DEL REPRESENTANTE DE LA PERSONA QUEJOSA EN AMPARO INDIRECTO. LA CARTA PODER FIRMADA POR ÉSTA ANTE DOS TESTIGOS ES SUFICIENTE PARA ACREDITARLA, CUANDO EL ACTO RECLAMADO SE RIJA POR LA LEY DEL PROCEDIMIENTO ADMINISTRATIVO DEL ESTADO DE JALISCO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029335",
    "Tesis": "I.2o.T.33 L (11a.)",
    "Rubro": "PRESTACIONES DE LAS PERSONAS TRABAJADORAS DEL INSTITUTO ELECTORAL DE LA CIUDAD DE MÉXICO (IECM). LAS RELATIVAS AL SEGURO DE GASTOS MÉDICOS MAYORES, SEGURO DE SEPARACIÓN INDIVIDUALIZADO, FONDO DE AHORRO Y VALES DE DESPENSA, NO PUEDEN SUPRIMIRSE CON BASE EN LA LEY DE AUSTERIDAD, TRANSPARENCIA EN REMUNERACIONES, PRESTACIONES Y EJERCICIO DE RECURSOS DE LA CIUDAD DE MÉXICO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029336",
    "Tesis": "VII.1o.P.2 K (11a.)",
    "Rubro": "PREVENCIONES PARA CUBRIR LOS REQUISITOS DE UNA DEMANDA DE AMPARO INDIRECTO. EL CÓMPUTO DEL PLAZO PARA QUE LA PERSONA QUEJOSA LAS DESAHOGUE CUANDO RESIDA FUERA DEL LUGAR DONDE LA JUZGADORA EJERCE JURISDICCIÓN, INICIA A PARTIR DE LA FECHA DE DEPÓSITO DEL ESCRITO RELATIVO EN LA OFICINA DE CORREOS DEL LUGAR DE SU RESIDENCIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029338",
    "Tesis": "XXVII.1o.4 A (11a.)",
    "Rubro": "PRUEBA PERICIAL EN AMPARO INDIRECTO. PROCEDE ADMITIR LA AMPLIACIÓN DE SU CUESTIONARIO PRESENTADA EXTEMPORÁNEAMENTE, SI LA OFERENTE ES POSESIONARIA DE UNA PARCELA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029339",
    "Tesis": "III.2o.T.72 L (11a.)",
    "Rubro": "PRUEBA TESTIMONIAL EN EL JUICIO LABORAL. LA MANIFESTACIÓN DEL OFERENTE EN EL SENTIDO DE QUE LOS TESTIGOS LE INDICARON QUE NECESITABAN SER CITADOS POR UNA AUTORIDAD, ES SUFICIENTE PARA QUE EL ÓRGANO JURISDICCIONAL LOS CITE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029340",
    "Tesis": "XXVII.1o.4 K (11a.)",
    "Rubro": "RECURSO DE QUEJA EN AMPARO INDIRECTO. PROCEDE CONTRA EL AUTO QUE DESECHA LA AMPLIACIÓN DEL CUESTIONARIO DE LA PRUEBA PERICIAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029341",
    "Tesis": "I.20o.A.39 A (11a.)",
    "Rubro": "REFUGIADOS. LAS PERSONAS EXTRANJERAS QUE MANIFIESTEN TEMOR FUNDADO DE PERSECUCIÓN DE GRUPOS DE CHOQUE CON AQUIESCENCIA DEL GOBIERNO DE SU PAÍS CON MOTIVO DE SU OPOSICIÓN POLÍTICA, ACREDITAN ESA CONDICIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029342",
    "Tesis": "III.2o.T.71 L (11a.)",
    "Rubro": "RESCISIÓN DE LA RELACIÓN LABORAL SIN RESPONSABILIDAD PARA EL PATRÓN. LA FALTA DEL AVISO POR ESCRITO NO IMPIDE ANALIZAR LA CAUSA QUE LA ORIGINÓ.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029345",
    "Tesis": "I.20o.A.38 A (11a.)",
    "Rubro": "SISTEMAS ALTERNATIVOS DE CONSUMO DE NICOTINA. LA PROHIBICIÓN ABSOLUTA DE CIRCULARLOS Y COMERCIALIZARLOS, VIOLA EL DERECHO A LA LIBERTAD DE COMERCIO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029348",
    "Tesis": "I.20o.A.37 A (11a.)",
    "Rubro": "SUSPENSIÓN PROVISIONAL EN AMPARO INDIRECTO. PROCEDE CONTRA LOS ATAQUES MEDIÁTICOS, DENOSTACIONES, INTIMIDACIONES O INSINUACIONES DE ILICITUD REALIZADAS POR EL JEFE DE GOBIERNO DE LA CIUDAD DE MÉXICO EN CONFERENCIAS DE PRENSA O REDES SOCIALES OFICIALES EN PERJUICIO DE UNA PERSONA JUZGADORA DEL PODER JUDICIAL DE LA FEDERACIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029349",
    "Tesis": "III.2o.T.73 L (11a.)",
    "Rubro": "TRIBUNAL DE ARBITRAJE Y ESCALAFÓN DEL ESTADO DE JALISCO. ES COMPETENTE PARA CONOCER DE LOS CONFLICTOS COLECTIVOS SOBRE DERECHOS ESTATUTARIOS DE ELECCIÓN SINDICAL ENTRE LOS SINDICATOS Y SUS AGREMIADOS PERTENECIENTES A ENTES PÚBLICOS LOCALES.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029350",
    "Tesis": "VII.2o.C.64 C (11a.)",
    "Rubro": "VIOLENCIA DE GÉNERO. ANTE SU EXISTENCIA O EL RIESGO DE QUE SE MATERIALICE, LOS TRIBUNALES DE ALZADA DEBEN DETERMINAR Y EJECUTAR DIRECTAMENTE LAS MEDIDAS DE PROTECCIÓN IDÓNEAS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029298",
    "Tesis": "PR.P.T.CS. J/9 L (11a.)",
    "Rubro": "“PAGO ADICIONAL (CONVENIO)” ESTABLECIDO EN LA CIRCULAR DGPE/045/2020 DE LA UNIVERSIDAD NACIONAL AUTÓNOMA DE MÉXICO. DEBE CUBRIRSE SÓLO CON EL “SUELDO TABULAR” SEGÚN LA ESCALA DE SALARIOS DEL CONTRATO COLECTIVO DE TRABAJO APLICABLE.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029300",
    "Tesis": "PR.P.T.CN. J/15 L (11a.)",
    "Rubro": "COMPETENCIA POR MATERIA PARA CONOCER DE LA DEMANDA PROMOVIDA EN LA VÍA ORDINARIA CONTRA EL AJUSTE O ACTUALIZACIÓN DE UNA PENSIÓN OTORGADA POR EL INSTITUTO MEXICANO DEL SEGURO SOCIAL. CORRESPONDE A LOS TRIBUNALES LABORALES FEDERALES DE ASUNTOS INDIVIDUALES.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029312",
    "Tesis": "PR.A.C.CN. J/25 A (11a.)",
    "Rubro": "DERECHOS POR SERVICIOS DE SUPERVISIÓN. LOS PERMISIONARIOS PARA LA GENERACIÓN DE ENERGÍA ELÉCTRICA DEBEN PAGARLOS ANUALMENTE (ARTÍCULO 56, FRACCIÓN II, DE LA LEY FEDERAL DE DERECHOS).",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029346",
    "Tesis": "PR.A.C.CN. J/33 A (11a.)",
    "Rubro": "SUSPENSIÓN EN AMPARO INDIRECTO. PROCEDE A FAVOR DE LAS PERSONAS AUTORIZADAS COMO OPERADORAS DE JUEGOS CON APUESTAS Y SORTEOS (REFORMAS AL REGLAMENTO DE LA LEY FEDERAL DE JUEGOS Y SORTEOS PUBLICADAS EL 16 DE NOVIEMBRE DE 2023).",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029347",
    "Tesis": "PR.P.T.CN. J/19 P (11a.)",
    "Rubro": "SUSPENSIÓN PROVISIONAL CON EFECTOS RESTITUTORIOS. PROCEDE CONTRA LA CONFIRMACIÓN DEL AUTO QUE FIJA FECHA PARA LA AUDIENCIA DE DEBATE, FUERA DE LOS PARÁMETROS PREVISTOS EN EL ARTÍCULO 349 DEL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029299",
    "Tesis": "PR.P.T.CS.2 L (11a.)",
    "Rubro": "COMPETENCIA PARA CONOCER DEL AMPARO DIRECTO CONTRA UNA SENTENCIA DEL TRIBUNAL ELECTORAL DE LA CIUDAD DE MÉXICO DICTADA EN UN JUICIO ESPECIAL LABORAL. CORRESPONDE A UN TRIBUNAL COLEGIADO DE CIRCUITO EN MATERIA DE TRABAJO.",
    "Localización": "[TA]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029303",
    "Tesis": "PR.A.C.CN.2 K (11a.)",
    "Rubro": "CONTRADICCIÓN DE CRITERIOS. ES IMPROCEDENTE CUANDO LA CUESTIÓN PLANTEADA VERSA SOBRE SI LA EXCEPCIÓN PREVISTA EN EL ARTÍCULO 53 DE LA LEY DE AMPARO, SÓLO SE ACTUALIZA CUANDO SE INVOCA COMO CAUSA DE IMPEDIMENTO LA MENCIONADA EN LA FRACCIÓN II DEL DIVERSO ARTÍCULO 51 O SI PUEDE PRESENTARSE RESPECTO DE OTRAS CAUSAS DE IMPEDIMENTO.",
    "Localización": "[TA]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029305",
    "Tesis": "PR.P.T.CN. 3 K (11a.)",
    "Rubro": "CONTRADICCIÓN DE CRITERIOS. ES INEXISTENTE CUANDO LOS TRIBUNALES COLEGIADOS DE CIRCUITO CONTENDIENTES RESUELVEN SUS ASUNTOS DE FORMA COINCIDENTE.",
    "Localización": "[TA]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029306",
    "Tesis": "PR.P.T.CN. 2 K (11a.)",
    "Rubro": "CONTRADICCIÓN DE CRITERIOS. PUEDE SUSCITARSE ENTRE TRIBUNALES COLEGIADOS DE CIRCUITO QUE AUXILIAN EN EL DICTADO DE SUS SENTENCIAS A UN DIVERSO ÓRGANO COLEGIADO.",
    "Localización": "[TA]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029264",
    "Tesis": "1a./J. 124/2024 (11a.)",
    "Rubro": "COMISIÓN REGULADORA DE ENERGÍA. EL ARTÍCULO 22 BIS, FRACCIÓN I, DE LA LEY FEDERAL PARA PREVENIR Y SANCIONAR LOS DELITOS COMETIDOS EN MATERIA DE HIDROCARBUROS, AL OTORGARLE LA FACULTAD DE IMPONER DIVERSAS MEDIDAS DE PREVENCIÓN, NO INVADE LA FACULTAD EXCLUSIVA DEL MINISTERIO PÚBLICO PARA FORMULAR E IMPULSAR LA ACUSACIÓN PENAL.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029265",
    "Tesis": "1a./J. 123/2024 (11a.)",
    "Rubro": "COMISIÓN REGULADORA DE ENERGÍA. EL ARTÍCULO 22 BIS, FRACCIÓN I, DE LA LEY FEDERAL PARA PREVENIR Y SANCIONAR LOS DELITOS COMETIDOS EN MATERIA DE HIDROCARBUROS, AL OTORGARLE LA FACULTAD DE IMPONER DIVERSAS MEDIDAS DE PREVENCIÓN, NO VULNERA EL PRINCIPIO DE SEGURIDAD JURÍDICA.",
    "Localización": "[J]; 11a. Época; 1a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029287",
    "Tesis": "2a./J. 62/2024 (11a.)",
    "Rubro": "SUPLENCIA DE LA QUEJA DEFICIENTE EN MATERIA AGRARIA. PROCEDE A FAVOR DE LOS POSESIONARIOS DE TIERRAS EJIDALES [ARTÍCULO 79, FRACCIÓN IV, INCISO B), DE LA LEY DE AMPARO].",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029263",
    "Tesis": "I.7o.P. J/2 P (11a.)",
    "Rubro": "AUTO DE VINCULACIÓN A PROCESO. AL RECLAMARSE EN EL JUICIO DE AMPARO INDIRECTO, EL JUEZ DE DISTRITO SÓLO DEBE CONSTATAR SU LEGALIDAD Y CONSTITUCIONALIDAD, SIN PONDERAR LOS DATOS DE PRUEBA QUE PERMITIERON SU DICTADO PUES, DE ACUERDO CON LOS PRINCIPIOS DE CONTRADICCIÓN E INMEDIACIÓN, ELLO CORRESPONDE AL JUEZ DE CONTROL.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029285",
    "Tesis": "X.2o.T. J/2 L (11a.)",
    "Rubro": "SENTENCIAS EN EL JUICIO LABORAL. PARA SU VALIDEZ DEBEN FIRMARSE TANTO POR LA PERSONA JUZGADORA COMO POR EL SECRETARIO INSTRUCTOR.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029268",
    "Tesis": "I.2o.C.18 C (11a.)",
    "Rubro": "CONTRATO DE SEGURO PARA FLOTILLAS Y COLECTIVIDADES ADQUIRIDO MEDIANTE UNA PLATAFORMA TECNOLÓGICA DE SERVICIO DE TRANSPORTE. PARA QUE EN EL JUICIO DONDE SE DEMANDE SU CUMPLIMIENTO LAS CONDICIONES GENERALES SURTAN EFECTOS PROBATORIOS, DEBEN HABERSE HECHO DEL CONOCIMIENTO DEL CONTRATANTE Y DEL TERCERO BENEFICIARIO Y ASEGURADO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029269",
    "Tesis": "XXXI.2 C (11a.)",
    "Rubro": "CONTRATO DE SUMINISTRO BÁSICO DE ENERGÍA ELÉCTRICA EN BAJA TENSIÓN. EN LA REVISIÓN A LOS SISTEMAS DE MEDICIÓN Y A LA INSTALACIÓN ELÉCTRICA, ES APLICABLE EL VIGENTE AL MOMENTO EN QUE EL USUARIO CONTRATÓ EL SERVICIO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029270",
    "Tesis": "IV.3o.C.13 C (11a.)",
    "Rubro": "CONTROVERSIAS EN MATERIA DE PROPIEDAD EN CONDOMINIO DE INMUEBLES. NO ES OBLIGATORIO ACUDIR ANTE LOS CENTROS DE MÉTODOS ALTERNOS DE SOLUCIÓN DE CONTROVERSIAS DEL PODER JUDICIAL DEL ESTADO DE NUEVO LEÓN PARA RESOLVERLAS, ANTES DE INSTAR LA VÍA JURISDICCIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029274",
    "Tesis": "III.4o.P.1 K (11a.)",
    "Rubro": "DEMANDA DE AMPARO INDIRECTO. DEBE ADMITIRSE LA PRESENTADA POR EL DEFENSOR DEL QUEJOSO QUE AFIRMA TENER RECONOCIDO ESE CARÁCTER EN DETERMINADA CARPETA DE INVESTIGACIÓN, CONTRA LA ORDEN DE APREHENSIÓN, RETENCIÓN Y/O COMPARECENCIA QUE PUDIERA EJECUTARSE CONTRA SU REPRESENTADO, EMANADA DE OTRAS CARPETAS QUE DESCONOCE POR NO HABER INTERVENIDO EN ELLAS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029273",
    "Tesis": "I.2o.C.15 C (11a.)",
    "Rubro": "DOBLE PAGO PREVISTO EN EL ARTÍCULO 547 DEL CÓDIGO DE PROCEDIMIENTOS CIVILES PARA EL DISTRITO FEDERAL, APLICABLE PARA LA CIUDAD DE MÉXICO. AL SER UNA SANCIÓN Y NO UNA MEDIDA DE APREMIO, SÓLO PUEDE APLICARSE EN LA HIPÓTESIS A QUE ALUDE DICHO PRECEPTO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029272",
    "Tesis": "I.2o.C.16 C (11a.)",
    "Rubro": "DOBLE PAGO PREVISTO EN EL ARTÍCULO 547 DEL CÓDIGO DE PROCEDIMIENTOS CIVILES PARA EL DISTRITO FEDERAL, APLICABLE PARA LA CIUDAD DE MÉXICO. ES INAPLICABLE CUANDO LA INSTITUCIÓN BANCARIA OMITA REMITIR A LA AUTORIDAD JURISDICCIONAL EL BILLETE DE DEPÓSITO POR LA CANTIDAD RETENIDA CON MOTIVO DE UN EMBARGO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029276",
    "Tesis": "I.20o.A.21 A (11a.)",
    "Rubro": "INTERÉS JURÍDICO EN EL JUICIO CONTENCIOSO ADMINISTRATIVO. LO TIENE CUALQUIER PERSONA PARA IMPUGNAR UN CERTIFICADO DE DERECHOS EXPEDIDO RESPECTO DE UNA OBRA QUE CONSIDERE DEL DOMINIO PÚBLICO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029277",
    "Tesis": "XVII.2o.P.A.35 A (11a.)",
    "Rubro": "INTERÉS SUSPENSIONAL EN EL JUICIO DE AMPARO INDIRECTO. CUANDO SE RECLAMA EL DECRETO POR EL QUE SE ADICIONA UN SEGUNDO PÁRRAFO AL ARTÍCULO 224 DE LA LEY ORGÁNICA DEL PODER JUDICIAL DE LA FEDERACIÓN, MEDIANTE EL CUAL SE EXTINGUEN DIVERSOS FIDEICOMISOS, ES SUFICIENTE QUE LAS PERSONAS QUEJOSAS ACREDITEN, AL MENOS INDICIARIAMENTE, QUE SIN SER DESTINATARIAS DE LA NORMA, SON TERCEROS QUE RESIENTEN UNA AFECTACIÓN INCONDICIONADA EN SENTIDO AMPLIO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029279",
    "Tesis": "X.1o.T.28 L (11a.)",
    "Rubro": "PENSIÓN POR ORFANDAD PARA LOS HIJOS E HIJAS CON DISCAPACIDAD PERMANENTE DE LAS PERSONAS TRABAJADORAS O PENSIONADAS DE PETRÓLEOS MEXICANOS (PEMEX). LOS ARTÍCULOS 3, 8, 9 Y 10 DEL REGLAMENTO DE PENSIÓN POST-MORTEM TIPO \"D\", ANEXO AL CONTRATO COLECTIVO DE TRABAJO, AL ESTABLECER UNA BASE DE CÁLCULO Y CONCEPTOS DIFERENTES RESPECTO DE LA PENSIÓN POR VIUDEZ, VIOLAN EL DERECHO HUMANO A LA IGUALDAD.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029280",
    "Tesis": "X.1o.T.29 L (11a.)",
    "Rubro": "PENSIÓN POR ORFANDAD PARA LOS HIJOS E HIJAS CON DISCAPACIDAD PERMANENTE DE LAS PERSONAS TRABAJADORAS O PENSIONADAS DE PETRÓLEOS MEXICANOS (PEMEX). LOS ARTÍCULOS 3, 8, 9 Y 10 DEL REGLAMENTO DE PENSIÓN POST-MORTEM TIPO \"D\", ANEXO AL CONTRATO COLECTIVO DE TRABAJO, AL ESTABLECER UNA BASE DE CÁLCULO Y CONCEPTOS DIFERENTES RESPECTO DE LA PENSIÓN POR VIUDEZ, VIOLAN EL DERECHO HUMANO A LA SEGURIDAD SOCIAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029281",
    "Tesis": "I.2o.C.17 C (11a.)",
    "Rubro": "PERSONAS CON DISCAPACIDAD. EL REQUERIMIENTO PARA QUE ACREDITEN SU CAPACIDAD DE EJERCICIO Y JUSTIFIQUEN SU LEGITIMACIÓN PROCESAL ACTIVA, ES INCONSTITUCIONAL E INCONVENCIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029278",
    "Tesis": "XVII.2o.P.A.34 A (11a.)",
    "Rubro": "PODER JUDICIAL DE LA FEDERACIÓN. EL DECRETO POR EL QUE SE ADICIONA UN SEGUNDO PÁRRAFO AL ARTÍCULO 224 DE LA LEY ORGÁNICA RELATIVA, MEDIANTE EL CUAL SE EXTINGUEN DIVERSOS FIDEICOMISOS, ADQUIRIÓ OBLIGATORIEDAD A PARTIR DEL DÍA SIGUIENTE AL DE SU PUBLICACIÓN EN EL DIARIO OFICIAL DE LA FEDERACIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029283",
    "Tesis": "I.2o.T.26 L (11a.)",
    "Rubro": "PRESCRIPCIÓN DE LA ACCIÓN EN MATERIA LABORAL. AUN EN EL NUEVO SISTEMA DE JUSTICIA LABORAL NO CABE SU ANÁLISIS OFICIOSO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029284",
    "Tesis": "I.2o.T.28 L (11a.)",
    "Rubro": "PRINCIPIO DE PRIMACÍA DE LA REALIDAD EN EL JUICIO LABORAL. PARA TENER POR ACREDITADO EL SALARIO BASE DE LA CONDENA, LA PERSONA JUZGADORA DEBE ANALIZAR LAS PRUEBAS DESDE LA BÚSQUEDA DE LA VERDAD MATERIAL Y NO DESDE SU CONTENIDO FORMAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029282",
    "Tesis": "III.1o.A.30 A (11a.)",
    "Rubro": "PROTOCOLOS PARA JUZGAR CON PERSPECTIVA DE GÉNERO Y DE DISCAPACIDAD EMITIDOS POR LA SUPREMA CORTE DE JUSTICIA DE LA NACIÓN. SON REGLAS MÍNIMAS QUE DEBEN APLICAR LAS PERSONAS JUZGADORAS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029286",
    "Tesis": "III.1o.A.29 A (11a.)",
    "Rubro": "SUPLENCIA DE LA QUEJA DEFICIENTE EN EL JUICIO CONTENCIOSO ADMINISTRATIVO EN EL ESTADO DE JALISCO. PROCEDE CUANDO UNA PERSONA INTEGRANTE DE LA SECRETARÍA DE SEGURIDAD PÚBLICA DEMANDA LA NULIDAD DE SU CESE INJUSTIFICADO Y EL PAGO DE LAS PRESTACIONES DERIVADAS DE SU NOMBRAMIENTO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029289",
    "Tesis": "I.20o.A.46 A (11a.)",
    "Rubro": "SUSPENSIÓN PROVISIONAL EN AMPARO INDIRECTO. ES IMPROCEDENTE CONTRA LA BAJA DE UNA PERSONA ALUMNA DEL CENTRO DE INVESTIGACIÓN Y DOCENCIA ECONÓMICAS, A.C., POR INCUMPLIR LOS REQUISITOS ACADÉMICOS DE PERMANENCIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029288",
    "Tesis": "XVII.2o.P.A.36 A (11a.)",
    "Rubro": "SUSPENSIÓN PROVISIONAL EN EL JUICIO DE AMPARO INDIRECTO. PROCEDE CONCEDERLA CONTRA LOS EFECTOS Y CONSECUENCIAS DEL DECRETO POR EL QUE SE ADICIONA UN SEGUNDO PÁRRAFO AL ARTÍCULO 224 DE LA LEY ORGÁNICA DEL PODER JUDICIAL DE LA FEDERACIÓN, MEDIANTE EL CUAL SE EXTINGUEN DIVERSOS FIDEICOMISOS.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029290",
    "Tesis": "I.2o.T.25 L (11a.)",
    "Rubro": "TIEMPO EXTRAORDINARIO DEL PERSONAL DE VIGILANCIA DE LA SECRETARÍA DE MEDIO AMBIENTE Y RECURSOS NATURALES (SEMARNAT). FORMA DE COMPUTAR SU PAGO TRATÁNDOSE DE JORNADA ESPECIAL DE 24 HORAS LABORADAS POR 24 DE DESCANSO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029291",
    "Tesis": "I.2o.T.24 L (11a.)",
    "Rubro": "TIEMPO EXTRAORDINARIO DEL PERSONAL DE VIGILANCIA DE LA SECRETARÍA DE MEDIO AMBIENTE Y RECURSOS NATURALES (SEMARNAT). PARA EFECTOS DE SU PAGO, LA JORNADA ESPECIAL DE 24 HORAS LABORADAS POR 24 DE DESCANSO DEBE CONSIDERARSE NOCTURNA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029266",
    "Tesis": "PR.P.T.CN. J/16 L (11a.)",
    "Rubro": "COMPETENCIA POR MATERIA PARA CONOCER DEL AMPARO EN REVISIÓN CUYO ACTO RECLAMADO SE ATRIBUYE AL TRIBUNAL DE JUSTICIA ADMINISTRATIVA DEL ESTADO DE SONORA, EN SU CARÁCTER DE TRIBUNAL BUROCRÁTICO. CORRESPONDE AL TRIBUNAL COLEGIADO DE CIRCUITO EN MATERIA DE TRABAJO.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029267",
    "Tesis": "PR.A.C.CS. J/4 A (11a.)",
    "Rubro": "CONTRATO DE ENAJENACIÓN DE DERECHOS PARCELARIOS. EL REGISTRO AGRARIO NACIONAL NO PUEDE NEGAR SU INSCRIPCIÓN CON BASE EN LA PRESUNCIÓN DERIVADA DE UN DICTAMEN TÉCNICO DE FECHA POSTERIOR A LA CALIFICACIÓN E INSCRIPCIÓN DEL ACUERDO QUE AUTORIZÓ EL CAMBIO DE DESTINO DE TIERRAS.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029271",
    "Tesis": "PR.A.C.CN. J/28 A (11a.)",
    "Rubro": "CONVENIO ADMINISTRATIVO. DE SU CELEBRACIÓN ENTRE UN PARTICULAR Y UN ENTE DEL PODER PÚBLICO PUEDEN DERIVAR ACTOS DE AUTORIDAD PARA EFECTOS DEL JUICIO DE AMPARO.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029275",
    "Tesis": "PR.A.C.CN. J/20 A (11a.)",
    "Rubro": "EFECTOS DEL AMPARO PROMOVIDO CONTRA LA APLICACIÓN DE PRECEPTOS NO IMPUGNADOS PERO DECLARADOS INCONSTITUCIONALES POR LA JURISPRUDENCIA. EN EL CASO DE LOS ARTÍCULOS 26, PÁRRAFO CUARTO, 139, PÁRRAFO CUARTO, 28 Y 29, DE LA LEY NÚMERO 36 DE INGRESOS Y PRESUPUESTO DE INGRESOS PARA EL EJERCICIO FISCAL 2022, DEL AYUNTAMIENTO DE HERMOSILLO, SONORA, SÓLO PROCEDE REINTEGRAR LA SUMA ENTERADA Y RECLAMADA, Y NO COMPRENDE ACTOS DE APLICACIÓN FUTURA.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029233",
    "Tesis": "2a./J. 59/2024 (11a.)",
    "Rubro": "APORTACIONES PATRONALES EN LOS RAMOS DE CESANTÍA EN EDAD AVANZADA Y VEJEZ. LOS ARTÍCULOS 168, FRACCIÓN II, INCISO A), DE LA LEY DEL SEGURO SOCIAL Y SEGUNDO TRANSITORIO DEL DECRETO QUE LA REFORMA, PUBLICADO EL 16 DE DICIEMBRE DE 2020, NO VIOLAN LOS PRINCIPIOS TRIBUTARIOS DE PROPORCIONALIDAD Y EQUIDAD.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029232",
    "Tesis": "2a./J. 60/2024 (11a.)",
    "Rubro": "APORTACIONES PATRONALES EN LOS RAMOS DE CESANTÍA EN EDAD AVANZADA Y VEJEZ. LOS ARTÍCULOS 168, FRACCIÓN II, INCISO A), DE LA LEY DEL SEGURO SOCIAL Y SEGUNDO TRANSITORIO DEL DECRETO QUE LA REFORMÓ, PUBLICADO EL 16 DE DICIEMBRE DE 2020, AL ESTABLECER UNA TARIFA PROGRESIVA PARA CALCULAR EL PAGO RESPECTIVO RESULTAN ADECUADOS Y PROPORCIONALES.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029231",
    "Tesis": "2a./J. 61/2024 (11a.)",
    "Rubro": "APORTACIONES PATRONALES EN LOS RAMOS DE CESANTÍA EN EDAD AVANZADA Y VEJEZ. LOS ELEMENTOS ESENCIALES PARA QUE LOS PATRONES LAS CALCULEN SE DESPRENDEN DE UN ANÁLISIS SISTEMÁTICO DE LA LEY DEL SEGURO SOCIAL.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029253",
    "Tesis": "2a./J. 58/2024 (11a.)",
    "Rubro": "PROCEDIMIENTO DE CONCILIACIÓN PREJUDICIAL. ES INNECESARIO AGOTARLO CUANDO SE DEMANDAN ÚNICA Y CONJUNTAMENTE LA DESIGNACIÓN DE BENEFICIARIOS DE UNA PERSONA TRABAJADORA FALLECIDA Y LA ENTREGA DEL SALDO DE SU CUENTA INDIVIDUAL DEL SISTEMA DE AHORRO PARA EL RETIRO.",
    "Localización": "[J]; 11a. Época; 2a. Sala; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029230",
    "Tesis": "XVII.1o.C.T.18 C (11a.)",
    "Rubro": "ACCIÓN CAUSAL PREVISTA EN EL ARTÍCULO 168 DE LA LEY GENERAL DE TÍTULOS Y OPERACIONES DE CRÉDITO. NO SUBSISTE, SI PREVIAMENTE SE EJERCIÓ LA ACCIÓN CAMBIARIA DIRECTA EN LA VÍA EJECUTIVA MERCANTIL, EN LA CUAL SE DICTÓ SENTENCIA CONDENATORIA Y DESPUÉS SE DECLARÓ PRESCRITO EL DERECHO SUSTANTIVO PARA EJECUTARLA, AL ACTUALIZARSE LA COSA JUZGADA REFLEJA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029237",
    "Tesis": "I.7o.T.5 L (11a.)",
    "Rubro": "COMPETENCIA EN MATERIA LABORAL. ANTES DE DECLINARLA, LAS PERSONAS JUZGADORAS DEBEN CITAR A LAS PARTES, CON INDEPENDENCIA DE LA ESPECIALIDAD O SUBESPECIALIDAD DEL ÓRGANO QUE ESTIMEN COMPETENTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029238",
    "Tesis": "I.6o.T.3 L (11a.)",
    "Rubro": "CONSTANCIA DE NO CONCILIACIÓN PREJUDICIAL. NO ES EXIGIBLE SI EN LA ETAPA ESCRITA DEL PROCEDIMIENTO SE INCORPORA OTRO DEMANDADO, DERIVADO DE UNA PRIMERA INTERVENCIÓN COMO TERCERO INTERESADO, Y EL ACTOR MANIFIESTA QUE SE LE TENGA CON AQUEL CARÁCTER.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029239",
    "Tesis": "VII.2o.C.67 K (11a.)",
    "Rubro": "CORTE DEL SUMINISTRO DE ENERGÍA ELÉCTRICA. CUANDO SE BASA EN EL CONTRATO MERCANTIL PARA EL SERVICIO DE SUMINISTRO BÁSICO DE ENERGÍA ELÉCTRICA EN BAJA TENSIÓN EN LA MODALIDAD POSPAGO, SE ACTUALIZA LA APLICACIÓN DEL ARTÍCULO 41 DE LA LEY DE LA INDUSTRIA ELÉCTRICA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029242",
    "Tesis": "II.1o.C.10 C (11a.)",
    "Rubro": "DECLARACIÓN DE AUSENCIA. PROCEDE LA APLICACIÓN DE LA LEY PARA LA DECLARACIÓN ESPECIAL DE AUSENCIA POR DESAPARICIÓN DE PERSONAS DEL ESTADO DE MÉXICO, EN EL PROCEDIMIENTO RELATIVO TRAMITADO EN LA VÍA CIVIL ANTES DE SU VIGENCIA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029243",
    "Tesis": "XV.6o.2 A (11a.)",
    "Rubro": "DEMANDA EN EL JUICIO CONTENCIOSO ADMINISTRATIVO FEDERAL. EL MAGISTRADO INSTRUCTOR DEBE ACORDAR A MÁS TARDAR AL DÍA SIGUIENTE EL ESCRITO PRESENTADO ANTES DEL VENCIMIENTO DEL PLAZO CORRESPONDIENTE, MEDIANTE EL CUAL SE PRETENDA DESAHOGAR EL REQUERIMIENTO RELATIVO Y SEÑALAR SI SE SATISFIZO LO SOLICITADO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029244",
    "Tesis": "I.6o.T.2 L (11a.)",
    "Rubro": "DÍGITO SINDICAL DE LAS PERSONAS TRABAJADORAS DE BASE Y LISTA DE RAYA BASE DEL GOBIERNO DE LA CIUDAD DE MÉXICO. SU OTORGAMIENTO NO CORRESPONDE A LA DEPENDENCIA EN LA QUE LABORAN, SINO AL GOBIERNO LOCAL, PREVIA AFILIACIÓN DEL TRABAJADOR AL SINDICATO Y CONFORME A LOS LINEAMIENTOS PARA SU ASIGNACIÓN.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029241",
    "Tesis": "III.3o.P.30 P (11a.)",
    "Rubro": "DOCUMENTOS COMO EVIDENCIA MATERIAL EN EL SISTEMA PENAL ACUSATORIO. SU VALORACIÓN POR EL TRIBUNAL DE ENJUICIAMIENTO SIN QUE SE HAYAN INCORPORADO AL DEBATE EN EL JUICIO ES ILEGAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029245",
    "Tesis": "III.3o.P.29 P (11a.)",
    "Rubro": "ENTREVISTAS REALIZADAS A TESTIGOS FALLECIDOS. PARA QUE CONSTITUYAN PRUEBA EN EL JUICIO ORAL DEBE ACREDITARSE SU DEFUNCIÓN Y QUE SE RESPETÓ EL PRINCIPIO DE CONTRADICCIÓN, AL INCORPORARSE MEDIANTE LECTURA A TRAVÉS DE LA PERSONA QUE LAS RECABÓ Y QUE NO SEAN LA PRUEBA DECISIVA QUE SUSTENTA LA CONDENA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029246",
    "Tesis": "VII.2o.C.65 K (11a.)",
    "Rubro": "EXCEPCIÓN AL PRINCIPIO DE DEFINITIVIDAD EN AMPARO INDIRECTO. EN LA ADMISIÓN DE LA DEMANDA NO ES FACTIBLE DETERMINAR SI SE ACTUALIZA LA PREVISTA EN LA TESIS DE JURISPRUDENCIA 1a./J. 77/2013 (10a.).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029247",
    "Tesis": "II.2o.P.51 P (11a.)",
    "Rubro": "EXTRADICIÓN INTERNACIONAL PROCEDIMIENTO DE. FASE JUDICIALIZADA. SON OBSERVABLES EN LO CONDUCENTE LAS FORMALIDADES QUE PREVÉ EL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES, PERO NO LE SON APLICABLES EN SENTIDO ESTRICTO LOS PRINCIPIOS DEL PROCESO PENAL ORDINARIO NACIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029248",
    "Tesis": "II.2o.P.50 P (11a.)",
    "Rubro": "EXTRADICIÓN. LA ETAPA ULTERIOR DEL PROCEDIMIENTO RELATIVO, CORRESPONDIENTE A LA SECRETARÍA DE RELACIONES EXTERIORES, NO CONSTITUYE UNA INSTANCIA SUPERIOR O RECURSO EN LA QUE SE REVISE LA OPINIÓN EMITIDA EN LA FASE JUDICIALIZADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029249",
    "Tesis": "II.2o.P.52 P (11a.)",
    "Rubro": "EXTRADICIÓN. LAS VIOLACIONES PROCESALES COMETIDAS EN LA FASE JUDICIALIZADA DEL PROCEDIMIENTO RELATIVO DEBEN RECLAMARSE EN LA PROPIA ETAPA, PARA QUE NO SE CONSUMEN IRREPARABLEMENTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029250",
    "Tesis": "II.2o.P.49 P (11a.)",
    "Rubro": "EXTRADICIÓN. SE CUMPLE EL PRINCIPIO DE DOBLE PENALIDAD CUANDO EN LOS ESTADOS UNIDOS DE AMÉRICA SE ATRIBUYE EL DELITO DE CONSPIRACY Y EN MÉXICO SE HOMOLOGA AL DE ASOCIACIÓN DELICTUOSA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029251",
    "Tesis": "XXVII.1o.1 C (11a.)",
    "Rubro": "INTERRUPCIÓN DE LA PRESCRIPCIÓN ADQUISITIVA DE BUENA FE. EL ARTÍCULO 1846, FRACCIÓN III, DEL CÓDIGO CIVIL PARA EL ESTADO DE QUINTANA ROO QUE LA PREVÉ, NO VIOLA EL DERECHO HUMANO A LA PROPIEDAD PRIVADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029234",
    "Tesis": "XX.1o.P.C.9 P (10a.)",
    "Rubro": "ORDEN DE APREHENSIÓN EN EL SISTEMA PENAL ACUSATORIO. ANTES DE LIBRARSE CONTRA PERSONAS SERVIDORAS PÚBLICAS CON FUERO CONSTITUCIONAL EN EL ESTADO DE CHIAPAS, ES NECESARIA LA DECLARATORIA DE PROCEDENCIA O DE DESAFUERO CORRESPONDIENTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029254",
    "Tesis": "IV.1o.P.3 P (11a.)",
    "Rubro": "PRIVACIÓN ILEGAL DE LA LIBERTAD. ESTE DELITO PUEDE CONFIGURARSE POR OBLIGAR A LA VÍCTIMA A PERMANECER CONTRA SU VOLUNTAD DENTRO DE UNA HABITACIÓN DE SU DOMICILIO (LEGISLACIÓN DEL ESTADO DE NUEVO LEÓN).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029255",
    "Tesis": "IV.1o.P.4 P (11a.)",
    "Rubro": "PRIVACIÓN ILEGAL DE LA LIBERTAD. LOS PADRES, CUSTODIOS Y/O TUTORES DE UNA PERSONA MENOR DE EDAD PUEDEN COMETER ESTE DELITO, CUANDO RESTRINGEN SU LIBERTAD AMBULATORIA A UN ÁREA ESPECÍFICA DENTRO DE SU DOMICILIO (LEGISLACIÓN DEL ESTADO DE NUEVO LEÓN).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029256",
    "Tesis": "I.8o.C.23 C (11a.)",
    "Rubro": "RECURSO DE QUEJA POR DENEGADA APELACIÓN. NO ES NECESARIO AGOTAR EL RECURSO DE REVOCACIÓN CONTRA EL AUTO QUE LO DESECHA O NIEGA SU ADMISIÓN, PARA QUE PROCEDA EL JUICIO DE AMPARO (LEGISLACIÓN DEL DISTRITO FEDERAL, AHORA CIUDAD DE MÉXICO).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029257",
    "Tesis": "I.8o.P.4 P (11a.)",
    "Rubro": "RECURSO INNOMINADO PREVISTO EN EL ARTÍCULO 258 DEL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES. ES IMPROCEDENTE CONTRA LA NEGATIVA DEL MINISTERIO PÚBLICO A LA PETICIÓN DE DEVOLUCIÓN, RESTITUCIÓN O ENTREGA DE INMUEBLES ASEGURADOS EN UNA CARPETA DE INVESTIGACIÓN O EN DEPÓSITO PROVISIONAL.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029259",
    "Tesis": "VII.2o.C.66 K (11a.)",
    "Rubro": "SUPLENCIA DE LA QUEJA DEFICIENTE PREVISTA EN LA FRACCIÓN VI DEL ARTÍCULO 79 DE LA LEY DE AMPARO. PROCEDE EN EL RECURSO DE REVISIÓN CUANDO AL RECLAMARSE EL CORTE DEL SUMINISTRO DE ENERGÍA ELÉCTRICA Y LA INCONSTITUCIONALIDAD DEL ARTÍCULO 41 DE LA LEY DE LA INDUSTRIA ELÉCTRICA, SE SOBRESEE EN EL JUICIO POR ESTIMAR QUE NO SE APLICÓ ESE PRECEPTO, SINO ÚNICAMENTE EL CONTRATO CORRESPONDIENTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029260",
    "Tesis": "XXI.2o.C.T.28 C (11a.)",
    "Rubro": "SUSPENSIÓN DEFINITIVA EN AMPARO INDIRECTO. PUEDEN MODIFICARSE SUS EFECTOS CUANDO SE CONCEDE PARA QUE NO SE EJECUTE LA SENTENCIA QUE REDUJO UNA PENSIÓN ALIMENTICIA, ANTE LA EXISTENCIA DE ACREEDORES ALIMENTARIOS DIVERSOS DE LOS ACTORES EN EL JUICIO EN QUE SE FIJÓ, PARA DISTRIBUIR EQUITATIVAMENTE SU MONTO.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029261",
    "Tesis": "XIII.2o.P.T.9 P (11a.)",
    "Rubro": "SUSTITUCIÓN DE LA PENA DE PRISIÓN. DEBE DESECHARSE LA SOLICITUD RELATIVA, FORMULADA POR UNA PERSONA SENTENCIADA PRÓFUGA DE LA JUSTICIA, A QUIEN SE LE GIRÓ ORDEN DE REAPREHENSIÓN POR NO HABERSE INTERNADO VOLUNTARIAMENTE EN EL CENTRO PENITENCIARIO PARA COMPURGARLA, AUN CUANDO ALEGUE QUE SE LE DEBE JUZGAR CON PERSPECTIVA DE PERSONA ADULTA MAYOR.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029236",
    "Tesis": "PR.P.T.CN. J/17 P (11a.)",
    "Rubro": "AUTO INICIAL EN EL AMPARO INDIRECTO. POR REGLA GENERAL NO ES LA ACTUACIÓN OPORTUNA PARA DILUCIDAR SI LA ADMISIÓN O EXCLUSIÓN DE PRUEBAS EN LA ETAPA INTERMEDIA DE JUICIO ORAL AFECTA DERECHOS SUSTANTIVOS.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029240",
    "Tesis": "PR.P.T.CN. J/14 L (11a.)",
    "Rubro": "CERTIFICADO DE DERECHOS OFRECIDO POR EL INSTITUTO MEXICANO DEL SEGURO SOCIAL EN SU CARÁCTER DE PATRÓN DEMANDADO. ES INEFICAZ PARA ACREDITAR LA ANTIGÜEDAD DEL TRABAJADOR, POR LO QUE PARA SU VALIDEZ DEBE ADMINICULARSE CON DIVERSO MATERIAL PROBATORIO.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029252",
    "Tesis": "PR.A.C.CN. J/24 A (11a.)",
    "Rubro": "JUICIO CONTENCIOSO ADMINISTRATIVO FEDERAL. PROCEDE CONTRA EL ACUSE DE RESPUESTA POR LA QUE LA AUTORIDAD FISCAL INFORMA AL CONTRIBUYENTE QUE NO CUMPLE LOS REQUISITOS DEL ARTÍCULO 27 DEL CÓDIGO FISCAL DE LA FEDERACIÓN, PARA PRESENTAR EL AVISO DE CANCELACIÓN EN EL REGISTRO FEDERAL DE CONTRIBUYENTES POR FUSIÓN DE SOCIEDADES.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029235",
    "Tesis": "PR.P.T.CS. J/3 P (11a.)",
    "Rubro": "ORDEN DE ASEGURAMIENTO O INMOVILIZACIÓN REGISTRAL O CATASTRAL DE BIENES INMUEBLES. COMO TÉCNICA DE INVESTIGACIÓN MINISTERIAL DEBE SER AUTORIZADA POR UN JUEZ DE CONTROL.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029258",
    "Tesis": "PR.A.C.CN. J/18 A (11a.)",
    "Rubro": "REVISIÓN DE GABINETE. SI SE ESTIMAN ILEGALES LOS REQUISITOS EXIGIDOS EN EL REQUERIMIENTO INICIAL PARA LA EXHIBICIÓN DE LA INFORMACIÓN, SE ACTUALIZA LA HIPÓTESIS DEL ARTÍCULO 51, FRACCIÓN III, DE LA LEY FEDERAL DE PROCEDIMIENTO CONTENCIOSO ADMINISTRATIVO.",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029262",
    "Tesis": "PR.P.T.CN. J/18 P (11a.)",
    "Rubro": "SUSTRACCIÓN A LA ACCIÓN DE LA JUSTICIA. NO ES NECESARIO QUE PREVIO A SU DECLARATORIA SE FORMULE LA IMPUTACIÓN (ARTÍCULO 141, PÁRRAFO CUARTO, DEL CÓDIGO NACIONAL DE PROCEDIMIENTOS PENALES).",
    "Localización": "[J]; 11a. Época; Plenos Regionales; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029187",
    "Tesis": "V.4o.P.A. J/1 A (11a.)",
    "Rubro": "CADUCIDAD DE LA INSTANCIA EN EL JUICIO CONTENCIOSO ADMINISTRATIVO EN EL ESTADO DE SONORA. NO SE ACTUALIZA POR INACTIVIDAD PROCESAL ATRIBUIBLE AL ÓRGANO JURISDICCIONAL.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029192",
    "Tesis": "V.4o.P.A. J/2 A (11a.)",
    "Rubro": "EXCEPCIÓN AL PRINCIPIO DE DEFINITIVIDAD EN AMPARO DIRECTO. SE ACTUALIZA CONTRA LA RESOLUCIÓN DEFINITIVA DICTADA POR EL PLENO DE LA SALA SUPERIOR DEL TRIBUNAL DE JUSTICIA ADMINISTRATIVA DEL ESTADO DE SONORA, CUANDO LA DEMANDA SE PRESENTÓ ANTES DEL 26 DE ENERO DE 2024.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029194",
    "Tesis": "VII.2o.T. J/19 L (11a.)",
    "Rubro": "HORAS EXTRAS DE LOS TRABAJADORES AL SERVICIO DEL ESTADO DE VERACRUZ. DEBEN EXCLUIRSE DE SU CONDENA LOS PERIODOS VACACIONALES Y LOS DÍAS DE DESCANSO OBLIGATORIO O FESTIVOS, CUANDO NO EXISTA CONTROVERSIA RESPECTO DE QUE NO SE LABORARON.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029199",
    "Tesis": "IX.2o.C.A. J/3 C (11a.)",
    "Rubro": "JUICIO ORAL MERCANTIL. EL HECHO DE QUE LAS AUDIENCIAS SE REALIZARAN POR VIDEOCONFERENCIA, DERIVADO DE LA EMERGENCIA SANITARIA POR EL VIRUS SARS-CoV-2 (COVID-19), NO ACTUALIZA UNA VIOLACIÓN PROCESAL QUE TRASCIENDA AL RESULTADO DEL FALLO.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029201",
    "Tesis": "X.1o.T. J/4 L (11a.)",
    "Rubro": "MODIFICACIÓN DE LA SUSPENSIÓN EN AMPARO DIRECTO. DEBE TRAMITARSE EN FORMA INCIDENTAL Y NO DECRETARSE DE PLANO.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029216",
    "Tesis": "I.7o.P. J/3 K (11a.)",
    "Rubro": "RECURSO DE QUEJA CONTRA EL AUTO QUE TIENE POR NO PRESENTADA LA DEMANDA DE AMPARO INDIRECTO SUSTENTADO EN UNA PREVENCIÓN INJUSTIFICADA. AL RESOLVERSE DEBE ANALIZARSE EL ACUERDO DE PREVENCIÓN, AUN CUANDO EL QUEJOSO NO LA DESAHOGARA.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029217",
    "Tesis": "II.3o.P. J/1 K (11a.)",
    "Rubro": "RECURSO DE RECLAMACIÓN EN AMPARO DIRECTO. ES IMPROCEDENTE CONTRA EL ACUERDO DICTADO POR LA PERSONA PRESIDENTA DE UN TRIBUNAL COLEGIADO DE CIRCUITO QUE ORDENA EMPLAZAR POR EDICTOS A LA TERCERA INTERESADA Y REQUIERE A LA QUEJOSA REALIZAR LAS GESTIONES NECESARIAS PARA PUBLICARLOS, CON EL APERCIBIMIENTO DE TENER POR NO PRESENTADA LA DEMANDA.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029218",
    "Tesis": "I.3o.A. J/3 A (11a.)",
    "Rubro": "RECURSO DE REVISIÓN FISCAL. LA PERSONA TITULAR DE LA SUBDIRECCIÓN DE LO CONTENCIOSO DE LA DIRECCIÓN JURÍDICA DEL INSTITUTO DE SEGURIDAD Y SERVICIOS SOCIALES DE LOS TRABAJADORES DEL ESTADO (ISSSTE), CARECE DE LEGITIMACIÓN PARA INTERPONERLO.",
    "Localización": "[J]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029184",
    "Tesis": "I.9o.P.74 P (11a.)",
    "Rubro": "AGRAVIOS EN EL RECURSO DE REVISIÓN EN AMPARO INDIRECTO. CUANDO SE DECLARAN INFUNDADOS LOS QUE CONTROVIERTEN LA CONCESIÓN DE LA PROTECCIÓN CONSTITUCIONAL CONTRA UNA ORDEN DE APREHENSIÓN AL NO ESTAR JUSTIFICADA LA NECESIDAD DE CAUTELA PARA SU EMISIÓN, ES INNECESARIO EL ESTUDIO DE LOS RESTANTES.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029186",
    "Tesis": "III.6o.C.10 C (11a.)",
    "Rubro": "AMPARO INDIRECTO. PROCEDE CONTRA LA OMISIÓN DE UN ENTE DE LA ADMINISTRACIÓN PÚBLICA, VENCIDO EN UN JUICIO CIVIL, DE CUMPLIR LA SENTENCIA CONDENATORIA CORRESPONDIENTE.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029188",
    "Tesis": "I.16o.A.3 A (11a.)",
    "Rubro": "DECLARACIÓN ADMINISTRATIVA DE CADUCIDAD DE UN REGISTRO MARCARIO. EL ARTÍCULO 373, FRACCIÓN IV, DEL CÓDIGO FEDERAL DE PROCEDIMIENTOS CIVILES ES INAPLICABLE SUPLETORIAMENTE AL PROCEDIMIENTO RELATIVO, PREVISTO EN LA LEY DE LA PROPIEDAD INDUSTRIAL ABROGADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029189",
    "Tesis": "(X Región)1o.4 L (11a.)",
    "Rubro": "DEFENSA ADECUADA DE LA PERSONA TRABAJADORA EN EL JUICIO LABORAL. LA AUTORIDAD DEBE VERIFICAR SI EL ABOGADO, LICENCIADO EN DERECHO O PASANTE, SATISFACE UN ESTÁNDAR MÍNIMO DE DILIGENCIA EN EL CUMPLIMIENTO DE SUS FUNCIONES, PARA TENER POR DEMOSTRADA SU CAPACIDAD TÉCNICA PARA DEFENDER A SU REPRESENTADA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029190",
    "Tesis": "VII.2o.C.63 K (11a.)",
    "Rubro": "DEMANDA DE AMPARO INDIRECTO. EN EL CÓMPUTO DEL PLAZO PARA SU PRESENTACIÓN DEBEN DESCONTARSE LOS DÍAS DEL PERIODO VACACIONAL DE LA AUTORIDAD RESPONSABLE EN MATERIA FAMILIAR, AUN CUANDO SE ESTABLEZCAN GUARDIAS PARA ATENDER ASUNTOS URGENTES (LEGISLACIÓN DEL ESTADO DE VERACRUZ DE IGNACIO DE LA LLAVE).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029191",
    "Tesis": "II.1o.A.20 A (11a.)",
    "Rubro": "DENUNCIA Y QUEJA ANTE LA PROCURADURÍA FEDERAL DEL CONSUMIDOR. SUS DIFERENCIAS TRATÁNDOSE DE LA UTILIZACIÓN DE LÍNEAS TELEFÓNICAS PARTICULARES PARA EL ENVÍO DE PUBLICIDAD.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029195",
    "Tesis": "III.1o.C.7 C (11a.)",
    "Rubro": "INCIDENTE DE EXCEPCIÓN DE PAGO CONTRA LA EJECUCIÓN DE LA SENTENCIA. LA INTERLOCUTORIA QUE LO RESUELVE ES INAPELABLE (LEGISLACIÓN CIVIL DEL ESTADO DE JALISCO).",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029196",
    "Tesis": "XVII.1o.C.T.11 L (11a.)",
    "Rubro": "INCREMENTO DE LA INDEMNIZACIÓN POR RIESGO DE TRABAJO POR CAUSA INEXCUSABLE DEL PATRÓN. PROCEDE SU ANÁLISIS AUN CUANDO NO SE SEÑALE EXPRESAMENTE EN LAS PRESTACIONES DE LA DEMANDA.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  },
  {
    "Registro digital": "2029197",
    "Tesis": "II.1o.A.21 A (11a.)",
    "Rubro": "INTEGRANTES DE LOS CUERPOS DE SEGURIDAD PÚBLICA DEL ESTADO DE MÉXICO Y SUS MUNICIPIOS. PROCEDE EL PAGO ADICIONAL DE 9 % DE INTERESES ANUALES CAPITALIZABLES AL MOMENTO DEL PAGO DE SU INDEMNIZACIÓN CONSTITUCIONAL, CUANDO EN EL JUICIO CONTENCIOSO ADMINISTRATIVO EN EL QUE SE LES OTORGA NO SE EMITA LA RESOLUCIÓN O NO SE CUMPLA EN EL PLAZO DE DOCE MESES.",
    "Localización": "[TA]; 11a. Época; T.C.C.; Semanario Judicial de la Federación"
  }
]
